{"0":"I want to start off saying that this camera is small for a reason.","1":"Some people, in their reviews, complain about its small size, and how it doesn't compare with larger cameras.","2":"I'm in high school, and this camera is perfect for what I use it for, carrying it around in my pocket so I can take pictures whenever I want to, of my friends and of funny things that happen.","3":"The only thing I don't like is the small size (8 MEG) memory card that comes with it.","4":"I have to move pictures off of it every day so I have room for more pictures the next, and I don't have enough money to buy the 256 MEG card that I've had my eye on for a while.","5":"A larger memory card and extra battery are good things to buy.","6":"Other than that pictures taken in the dark are not as nice as I'd like them,","7":"I'd say that this camera is perfect.","8":"OK, not quite everything...but this camera is so compact that you will have it by your side when you need it.","9":"I bought this camera for the same reason many of you are considering it, or have already bought it--it's size.","10":"It is amazingly small, it's hard to believe all that has been packed into this camera.","11":"I take it with me everywhere,literally,","12":"it is so small that I am able to keep it in my pocket, and I don't have to fear that it will get ruined in my pocket because it is so durable.","13":"There is also a small covering for the lens, so you need not worry that the lens will get scratched.","14":"The picture quality surprised me, when I first saw this camera I saw how small it was an instantly assumed that the picture quality would not be good--but I was wrong!","15":"The picture quality of this camera is outstanding (taking its' size and price into consideration).","16":"However, I do have a few things to complain about...","17":"First off, the battery.","18":"This camera uses a lithium battery, I find lithium batteries to be highly inconvenient; because what if you are on vacation, where the nearest place to buy batteries is just a gas station--there is no way that you are going to find lithium batteries there.","19":"Not only is it inconvenient, but also the battery life span is short.","20":"The longest I've had it work was about 1 hour and 45 minutes.","21":"This isn't uncommon in cameras, though, just as long as you bring your charger and spare batteries, you should be fine.","22":"Another problem I had with this camera was the zoom function.","23":"Such a small zoom length that you would think that the zoom would be silent since it hardly zooms in...wrong!","24":"Very wrong.","25":"The zoom function on this camera is so loud that sometimes you will be unable to use it if you find yourself in a situation where you must be quiet.","26":"Even just turning the camera on will move the lens a little, resulting in a noisy start-up.","27":"The flash is very weak.","28":"Really dissapointing. If you are inside, you can't be any farther away then 10 feet in a lit room.","29":"The last problem I found with this camera was the macro function.","30":"The auto-focus on the camera seems to have trouble focusing on the subject.","31":"To make matters work, there is no manual override to overcome this problem.","32":"The focus is great, though, if you are not taking a macro shot.","33":"These are all the flaws I found in the camera,","34":"it's not my first choice in cameras,","35":"I have come across many other beginner cameras that I prefer over this camera, but the thing you have to keep in mind about this camera is the size.","36":"If you are just looking for something to keep with you at all times, then this is a great camera choice.","37":"I researched digital cameras for a month before purchasing the s100...","38":"after considering my needs further and researching the marketplace, I decided on the s100.","39":"I have had this little gem for four months now.","40":"It has given me zero problems, and the more I use it, the better I become at taking advantage of its strengths.","41":"I had a regular Canon Elph (APS), as well as a JVC digital camera.","42":"I was looking for a blend of the two and so I bought this camera.","43":"I'll share some observations that may differ a bit from what other reviewers have noted.","44":"1) It is perhaps too small.","45":"I find it a bit difficult to manage the very tiny buttons and impossible to read the icons without my reading glasses on.","46":"Its size makes holding it steady for long a bit of a challenge (not enough camera body to grip with more than your finger tips).","47":"2) The delay from the time you fully depress the shutter to the time the picture is taken is too long and may yield some fuzzy shots.","48":"This is due to the unusually slow autofocus system.","49":"3) The lack of an intermediate resolution setting, as other reviewers have suggested, is a problem, but that problem is meaningless with a larger CompactFlash memory card","50":"(I got a 64 meg card for $... and it holds 105 pics at 1600 x 1200 res).","51":"4) The camera gets really hot when you are busy snapping away.","52":"It is hot enough to be annoying.","53":"Canon says it's normal.","54":"I have found it gets less warm with the LCD off.","55":"This wonderfully small digital camera produces fantastically good pictures printed on any decent photo-quality printer (with photo quality paper).","56":"It will not replace your high-end 35mm SLR but it's a great toy to keep near you at all times for snapshots.","57":"I have used many digital cameras.","58":"This IS the best camera you can have for digital images if you want to:","59":"Take quick pictures with excelent resolution","60":"Hate to wait between shots","61":"Download it fast to your computer","62":"Have a great and easy to use bundled software","63":"Travel with it without knowing you have it in your pocket","64":"FYI, Battery doesn't die if you don't use LCD","65":"The color and light I captured with this camera on a 12-day trip to Turkey (gorgeous vividly colored ceramic tiles inside darkened mosques) were far superior to anything I've ever gotten with a traditional 35-mm film camera.","66":"I love this camera.","67":"I don't believe this camera is still available. But if you can find one, you might like to get it.","68":"It's still one of the smallest 2MP digital cameras on the market, and absolutely one of the best-built most stylish cameras ever.","69":"I bought my camera based on recommendations from my other friends who own it.","70":"I am very pleased with my purchase.","71":"It's best to list the pros and cons of this camera:","72":"I've been incredibly happy with this camera.","73":"This camera is great if you're used to a high-end SLR.","74":"It's overkill for simple snapshots, unless you've got way too much money to blow.","75":"Exposure compensation in 1\/3 stop increments (I leave it set on +1\/3 stop to brighten up the default exposure, which goes a bit dark for my taste).","76":"Slow-syncro flash, macro\/infinity mode, etc.","77":"The zoom range is a little narrow (35-70mm in 35mm film equivalent), but given that the camera is the same as my wallet, I can't think of any real complaint.","78":"The SS body is wonderful, feels high-quality.","79":"It's the same body as the popular ELP2 APS camera (take a look at a standard credit card from your wallet and you'll have an idea of the front profile!).","80":"A 2X optical zoom (you can pretty much ignore any time a  manufacturer refers to \"digital zoom\")","81":"I left the camera in my car in Maine (not a very hot place) and the LCD screen cracked !","82":"I then realized a major design flaw.","83":"All the camera's functionality is only available (or selectable) when the screen is functional.","84":"When the screen stops working, you're out of luck !","85":"I wrote another review and this is the update.","86":"I discovered that the camera has a manual mode that gives you total control over exposure, white balance, flash (red eye, person against bright background, flash on, flash off, flash automatic).","87":"I have used this camera for about 3 weeks so far, taking over 500 pictures.","88":"I have 2 batteries and a 128 mb card.","89":"Here are some useful facts:-","90":"On a battery charge, the camera takes approximately 70 pictures, where the camera is opened and closed between pictures.","91":"A 64mb card stores approximately 100 pictures at default resolution (ie between 500k and 1.5mb per picture).","92":"The viewfinder does not accurately represent the pucture being taken.","93":"The LCD should be used.","94":"However, in dark settings you must use the viewfinder.","95":"The digital zoom is crap.","96":"Turn it off.","97":"It fits in your pocket.","98":"The closest competitor is the SONY DSC-P1 (3.3mp).","99":"But that camera is a little larger and you defeat the whole purpose of having a truly portable camera.","100":"I take my camera everywhere.","101":"Tamrac makes a tiny pouch that is best for the camera.","102":"The front even has a zipper for an extra battery and your wallet stuff.","103":"The panorama setting is unbelieveable !","104":"You take around 12 pictures in a circle, stitch them together and voila; you have a perfect memory of where you were standing !","105":"The pictures are a little dark sometimes.","106":"You have the option to have the flash automatic or off.","107":"The new Canon s300 is 33% larger and 26% heavier than the S100.","108":"The movie mode can only record a max of 30 seconds at 160X120 per clip and a max of 4 seconds at 640X480.","109":"It has one more resolution of 1024X768 and a \"Normal\" compression mode.  And, it has the 3X zoom.","110":"The price is $... more.","111":"I originally gave this camera 5 stars. When I had Windows 98 it was wonderful but I got a new computer last November with XP the usb software is Sooo... not compatible with XP","112":"I have found however that you can just buy a card reader to solve this problem.","113":"The new drivers on cannon's site do not help at all but try them if you want they have made me have to use the backup software.","114":"The Adobe software also was wonderful in 98 but it will not let you print correctly with XP so you are forced to create your document then either print it from Windows or export it to another application.","115":"But it takes gorgeous pictures for a 2.1 MP camera.","116":"I love this camera!","117":" the only thing I don't like about it is that You have to buy a larger memory card, first thing!","118":"I got this camera for an unbelievably low price at amazon.","119":"I would recommend this camera unequivocally!","120":"I got this camera for an unbelievably low price at amazon.","121":"I would recommend this camera unequivocally!","122":"My last digital camera was an Apple QuickTake 200, which shot 640x480 pixel images.","123":"The Apple was actually better in two repects: it turned-on quickly and it showed you what you just shot right after you shot it.","124":"The  ELPH will do the latter but you must hold down the shutter button to view  it.","125":"But this DOES work even if you turn off the LCD viewing -- great  battery saver.","126":"I've been using this camera for a few months now.","127":"A great camera, but here are some points which I don't notice in most of the reviews here, which may be of concern especially to the more advanced amatuer:","128":"Good quality and fun!","129":"I purchased the Elph s100 mainly because I thought it was cool.","130":"I'm a professional photographer using pro digital equipment and I was looking for something to have around the house so that my wife could capture candid moments with my kids.","131":"In practice, we've been VERY happy with the results.","132":"The camera does a great job with exposure and prints made with my professional printer looks great (not as good as prints from my pro digital camera, but still VERY good).","133":"My last digital camera was the Canon Powershot A5 Zoom, which I liked  quite a bit.","134":"But I was ready to upgrade and when I discovered that Canon  was going to come out with an even smaller digital camera with a higher  resolution, I had to have the S100.","135":"This is my second digital camera, but I'm much more impressed with the Canon S100 Digital Elph than I EVER was with my Kodak DC240.","136":"This camera is so light and tiny that I literally carry it everywhere with me, which is great considering I'm an artist and like to capture interesting items for future painting.","137":"The software that comes with the Digital Elph is very nice and intuitive.","138":"I especially like the way that ZoomBrowser EX lets you look at a virtual filmstrip of your pictures.","139":"The PhotoStitch software is very cool if you want to do any 360 degree panorama shots.","140":"I'd suggest that you not only buy this camera, but the case for it and an extra battery pack.","141":"My only complaint and the reason I gave it 4 stars instead of 5 is that the on-camera controls aren't as intuitive as they should be.","142":"I've often struggled to get something to work the way I want it, and hate to have to carry the manual with me all the time!","143":"Other than that, I love this camera.","144":"The pictures are uniformly excellent and color rendering is perfect.","145":"The good:  Small size; durable-seeming metal case; easy to use; visually distinctive; good picture quality; fast USB connection; mostly intuitive operation; really cool PhotoStitch software that knits pictures together to give wide panoramas.","146":"If compact size is your highest priority in a 2-megapixel camera, the Canon PowerShot S100 Digital Elph is a standout choice and aptly named for its diminutive design.","147":"The S100's image quality rates in the middle of its class, but it can still be a reasonable choice for students, families, or small businesses looking for an ultra-portable camera that weighs less than half a pound with media and battery pack.","148":"Recently I was at dinner with some friends, and we were debating the merits of one digital camera vs. another.","149":"One of my friends was going on and on about his camera and how fancy it was.","150":"While he was talking, I took my S100 out of the front pocket of my Levi's and took his picture.","151":"I said, can your fancy camera do that?","152":"No, because he doesn't (can't) always carry his with him.","153":"End of story.","154":"I purchased this camera before it went on sale, and while I wouldn't have minded keeping the extra $$$, it was definitely worth it.","155":"I have been absolutely, completely satisfied with the product and its capabilities.","156":"I am no computer expert, and this is my first (and probably last) digital camera.","157":"This is a great product, and Canon has done an excellent job.","158":"I've been very reluctant to join the digital camera communitysince I've been an avid \"legacy\" photographer for most of mylife.","159":"I received this little jewel as a gift and I can honestly say Iabsolutely love it.","160":"I give this product five stars for its usability,performance, expandability, and definitely looks!","161":"I've had this camera for three years.","162":"price[-1][u]I bought it new, when it was cutting edge and very expensive.","163":"I put a 128MB CF card in it.","164":"First, I have to say that I have NEVER had the slightest problem with this camera or the software.","165":"I've probably taken upwards of 5000 pictures with it, it's been all over the country.","166":"The software has been installed on Windows 95, 98, 2000 and XP and I haven't had any problems with it.","167":"The camera is solid, performs well, takes good pictures, and the battery lasts pretty long if you disable the LCD viewfinder.","168":"If battery life were that big a deal, one could purchase a second battery and rotate.","169":"All that said, I am a little disappointed with the quality of the pictures from the camera.","170":"They are razor sharp, the color balance is perfect, and the focus is great.","171":"When taking pictures of people, however, it shows EVERY flaw in the subject's skin.","172":"Scratches, oil, freckles are magnified and come out looking horrific.","173":"It requires extensive Photoshopping to fix the flaws.","174":"Other cameras taking pics of the same subjects turn out looking much better.","175":"I will also say that it takes a very long moment for the camera to do its digital image processing between the time you press the button and when the camera actually takes the picture.","176":"By the time the shot's taken, something (especially a squirmy child or a sports play) has invariably moved and it's not the exact picture you wanted.","177":"I'm going to buy a real Single-Lens Reflex (SLR) to take baby pictures, but I'll keep this as a travel camera.","178":"I'm a writer and new to digital photography.","179":"I've owned a few 35mm cameras over the years, including one SLR and two point & shoots.","180":"I had been waiting for the prices of digital cameras to come down before  taking the plunge.","181":"This year, with a cruise to Nova Scotia coming in  August, I decided the time was right and just purchased a Canon S100  Digital Elph.","182":"I must say, I think this is the coolest camera I've ever  owned!","183":"First, it really is tiny; the size of a pack of cigarettes, maybe  a scooch deeper.","184":"The included battery charger is larger!","185":"Second, it is  incredibly easy to use.","186":"I just went on a quick photo shoot in NYC's  Central Park today, and what a bunch of beautiful photos I took, if I do  say so myself (and I do!)","187":"The camera is as easy to use as a point and  shoot, and with instant review on the LCD screen, you can retake any  flubbed shots on the spot.","188":"The two-times optical zoom operates smoothly  and quietly, and lo and behold, a two-piece shutter-like cap automatically  slides closed over the lens when you turn the camera off.","189":"I also had no  problems installing or running the camera software on my PC.","190":"I'm still  learning about file sizes (and how large is too large to email), and I did  erase one photo I wanted to keep as I was getting used to the menu system.","191":"But otherwise I am thrilled to have taken the plunge into digital  photography.","192":"And there are two more advantages to digital photography  which I hadn't anticipated, beyond the lack of film and developing.","193":"One is  the lack of censorship of your photos -- time for some, uh, fashion  photography of your wife or girlfriend, if that's something you both would  enjoy!","194":"Another is the ability to upload images from your PC to a memory  card in the camera.","195":"This is a great source of personal entertainment for  travelers, if you catch my drift, and you can zoom in on the LCD images!","196":"I  would also recommend Canon's soft case for the camera, which has a slot to  attach to your belt along with a second nicely finished compartment to hold  an extra battery or memory card.","197":"As other reviews have noted, you will  definitely want one or more additional memory cards.","198":"I've found I can get  from nine to twelve compressed 1600 X 1200 photos on one 8MB card, or 28  images uploaded from my PC.","199":"At any rate, if you have been interested in  digital photography but the price and confusion have held you back,  consider the Canon S100 Digital Elph.","200":"It really is the perfect travel  camera, plus it offers the convenience of digital photography.","201":"Why did I wait so long?","202":"If you're looking for a digital camera to replace your big Nikon or Canon SLR, forget it - film is still king when exquisite detail and fine color rendition are critical.","203":"Before you give up on digital cameras, though, ask yourself a few questions:","204":"got this as it flew off the shelves.","205":"Really like it, easy to use, great images, very intuitive, fits in my jacket pocket.","206":"What else can I say?","207":"I was looking for a compact, rugged (I carry it hiking, skiing, boating, etc) camera which is easy to use.","208":"I wanted standard memory expansion (CF cards), macro mode, and if possible, a waterproof housing (for kayaking).","209":"This is the only camera with all these capabilities.","210":"Even with the waterproof housing it is small.","211":"The lens retracts and has its own metal cover so you don't need to fuss with a lens cap.","212":"The metal housing seems very rugged.","213":"Turn-on to ready-to-shoot is about 3 seconds.","214":"I'd give it  5 stars if the automatic modes were better and if there were true manual focus and exposure modes.","215":"For example, in auto mode you can't use the flash redeye reduction, you must be in manual mode for that.","216":"The auto color balance is often fooled by dense clouds.","217":"You need to use the manual exposure adjustment in backlight or bright light conditions such as with snow in the background.","218":"The dynamic range seems not quite as good as the Kodak DC260.","219":"The macro mode works well, although it takes some practice since the camera doesn't clearly indicate when it can't focus.","220":"The white-LED backlit LCD is very bright and crisp, even in sunlight, and relatively easy on the battery.","221":"The panorama modes are wonderful.","222":"Buy at least two batteries and you'll never run out in the field.","223":"High-res photos take 1-1.5 MBytes each so you want a CF card sized accordingly.","224":"It's so small and light, even with a spare battery, you really can take it anywhere.","225":"In auto mode anyone can use it as a point and shoot camera.","226":"The manual modes give you a lot of control over exposure and white balance (but there is no manual focus or manual exposure).","227":"1600x1200 means really good, cropped 5x7 prints and acceptable 8x10s.","228":"There are better cameras but none anywhere near as light and compact.","229":"It's a little jewel.","230":"1- Small.","231":"VERY smal.","232":"You'll carry it with you every day.","233":"I've been taking near 100 pictures per month since I got mine.","234":"I've had a lot of cameras, but this one is ACTUALLY being used, and not stored in a desk: it's allways in my shist pocket.","235":"2- Excellent picture quality and so simple to use!!!","236":"Fool proof.","237":"I started shooting even before reading the manual (not recommended at all).","238":"3- USB kicks!","239":"2 secs to download a 600KB 1600x1200 picture!","240":"4- Looks great.","241":"Silver metal case -NOT PLASTIC.","242":"5- Excelent software package.","243":"6- Small but very clear TFT screen.","244":"Take shots at angles you thought you wouldn't.","245":"Don't care about sunlight: it's TFT.","246":"7- 360\u001a panoramic pictures are a very big deal.","247":"8- Buttons are little, but If you have steady fingers and dealed with a casio wirst calculator watch, you can deal with almost anything.","248":"Buttons size is OK for me, my wife, but not my grany.","249":"9- Cons? Not a single one after 5 months.","250":"i researched and researched between getting the canon s20 or the canon s100, and of course i got the latter!","251":"and i'm glad i did!","252":"I was looking for something that wasn't too complicated to use and to help the pics I post on Ebay show more detial.","253":"This camera is great, wonderfully small, and has attactive hi-tech casing.","254":"Very easy to use for someone like me who's just hopping on the digital camera bandwagon.","255":"I love not having to go to Walgreen's to get my pictures develpoed anymore!","256":"Definitely a good investment.","257":"The controls are easy to understand and big enough that they are easy to see and use.","258":"I would recommend spending a little money and this will be the perfect digital camera.","259":"I added a second battery (about $69, recharges in about two hours) and a large (192Mb for less than $400) CF module.","260":"Now I can take over 300 1600 x 1280 shots (or for the webshot fanatic, 1,141 pictures at 640 x 480).","261":"The optical and digital zooms combine to give an effective 4x zoom.","262":"This is enough capacity and capability to do a complete household inventory, for example.","263":"While this might seem pricy, I have been spending $27 for 25 APS images, with prints and a CD, so this camera will pay for itself in a year.","264":"I have a 35mm camera outfit that cost quite a bit of money a few years ago.","265":"So, why the small Digital Elph, rather than one of the other cameras with better resolution or picture quality? size[+2]","266":"because, unless it's small, I won't cary it around.","267":"If I won't cary it around, I won't use it, and if I won't use it, what's the point?","268":"My first impression of Elph S100 was that there couldn't POSSIBLY be room in the thing for anything other than a battery and a memory card.","269":"Somehow, the engineers at Canon did it, and the results are nothing less than astounding.","270":"I was a little skeptical about what people had said about this camera, because it's just so small.","271":"After getting one for Christmas from Amazon, I'm now a believer:  The Digital Elph is truly the world's smallest digital camera that shoots great pictures.","272":"I've had this camera just over 2 years and it takes pretty good pictures.","273":"The size is tiny, which I love.","274":"We bought extra memory and a backup battery (so we can use one while the other is charging).","275":"Sometimes the pictures are onthe dark side, but I'm able to fix that using the Photoshop 6.0 \"adjust levels\" function ... not sure how a person would do that without Photoshop, though.","276":"OK so I bookmarked pages about this camera on our home computer, in a place I was sure my wife would see, and loh and behold, what did I get.","277":"Thank you Santa!","278":"I bought this camera at the end of August.","279":"With the camera I also bought a 128MB compact flash card, an extra battery, and a carrying case.","280":"I also recently bought Viking's IntelliFlash Memory Reader.","281":"I've got a couple of digital cameras.","282":"An Olympus 2500 and an Olympus 620.","283":"Really like them,  they work well and the macro function of the 2500 really helps my Ebay biz.","284":"BUT they are big cameras,  they have to reside in a large case,  they need all kinds of batteries,  in short they're a pain to lug around.","285":"I've struggled for years with supposedly high-quality point and shoot 35mm cameras delivering astonishingly inconsistent results.","286":"The Canon S100 destroys this problem.","287":"I've had this camera for roughly 3 weeks now and I've taken approximately 250 pictures.","288":"The results are superb...  both in print and over the computer.","289":"Positives:","290":"This camera is so easy to use!","291":"I just took it out of the box, charged the battery, and started taking pictures.","292":"All the features are incredibly intuitive, even for a novice like me.","293":"I would recommend getting a larger Compact Flash card, because once you start taking pictures, you won't want to stop.","294":"The pictures are beautiful, and the camera is so small you can carry it anywhere.","295":"I, as many others, have waited for many years for the convergence of price, features, size and ease of use to hit that happy center point.","296":"Well wait no more!","297":"I bought this little guy a few weeks back, and I have to saythat I never had so much fun with a new toy as this.","298":"You willdefinitly appreciate the small size.","299":"You can take it anywhere withyou, unlike other bulky cameras, and capture every moment of yourlife."}