{"0":"Works great, no odor, and uses regular bags.","1":"Can't complain at all!","2":"So far (3 weeks), we've had no problems with the Diaper Champ at all.","3":"It contains the smell from our baby's diapers and we can use just about any kind of bag inside.","4":"I also sprinkled baking soda in the bottom of the Diaper Champ to help absorb odors - every once in awhile I just empty the old baking soda out and replace it.","5":"I don't know if we'll run into trouble down the road with odors, but so far I have no complaints and I'm very happy not to have to buy those refills.","6":"We started with the Diaper Genie as most new parents do.","7":"We hated that thing!","8":"The \"new\" design still needs lots of improvement!","9":"The bags never fit right and then it never spun right.","10":"And after about two months it just sat there in the corner of her room and was never used.","11":"As she entered into toddlerhood we started having some bad diapers just becasue of her cutting teeth and diet changes.","12":"We decided we had to have something so we started researching.","13":"The Diaper Champ is the best we found!","14":"There are no specail bags to deal with or buy!","15":"We use the cheap $1.99 13 gallon vanilla scented bags from the grocery store but you can use any bag you have laying around.","16":"There is also no trick to it.","17":"No spinning it or anyhting!","18":"Just flip the handle and the diaper is gone!","19":"Now it will start smelling if you leave it with diapers in it for an extended period but all of them will!","20":"We empty ours every day and we have never had an odors from it!","21":"It is far better than just a trash can or the Diaper Genie and it's fairly inexpensive as baby products go!","22":"In concept, it's a fabulous idea.","23":"I love that you don't have to purchase expensive refills.","24":"I just go to [the store] and purchase tall kitchen bags and use those for the Diaper Champ.","25":"The cons, at times the diaper wipes get stuck in the disposal area making it hard to turn the handle back and forth.","26":"In addition, I don't believe that it is odorless.","27":"My daughter is only 4 months old and we do notice an odor.","28":"I'm concerned that as she gets older the #2 diapers will only get worse.","29":"If I had to do it over again, even with the cost savings of using any type of bag, I would go w\/ the Diaper Genie.","30":"It's far better than all others on the market.","31":"it's easier and much more convenient to use because it doesn't have CLUMSY and CONFUSING (not to mention expensive) refills.","32":"There is no odor and extremely easy to use.","33":"Having one of these helps from needing to take out the trash daily for the guys!","34":"My daughter is now 2 and 1\/2, and I am still enjoying this product.","35":"We purchased it based on the reviews, and it really lived up to our expectations.","36":"We liked it because:","37":"1. It uses regular garbage bags instead of brand refills.","38":"2. You can dump regular trash into it and not feel as though you've wasted plastic.","39":"3. It never smelled - at all.","40":"Here's the catch for us- our daughter never drank formula, which is what gives baby waste a foul smell, and when she was eating solids we followed the American Pediatric Association recommendation to flush solid products instead of disposing of them.","41":"I don't know how this product would hold up to either of these situations.","42":"I just know it really worked for us.","43":"The container is hard to open, which is exactly what you want when your baby becomes a toddler, and you do have to flip the handle carefully (which has saved more than a few of her toys,too.) I don't consider these difficulties but features for the older baby.","44":"We graduated to real underwear last week in our house, and I'm passing this on instead of retiring it- it's too good to sit unused in the basement or dump.","45":"WRONG!","46":"Even with newborn diapers it filled way too fast.","47":"It seemed as if we were empting the pail everyday and it was in no way odorless.","48":"Save your money invest in plastic bags and dispose of diapers by sealing them in the bags and placing them in the regular garbage.","49":"A MUST HAVE!","50":"This is a MUST HAVE product for all new moms!","51":"The one thing that sets this product apart from the diaper genie is that this product can use regular garbage bags.","52":"ANY Garbage bags will fit.","53":"The Diaper Genie needs it's own refill bags in order to work and that's just more money that you don't have to spend.","54":"This is easy to work and easy to dispose of the dirty diapers.","55":"FANTASTIC!","56":"I find the major problem with this item is that if you have a very messy diaper and can't tightly bundle it without a mess, the mess gets all over the module that dumps the diaper and the stink is OUTSIDE of the diaper pail.","57":"My main complaints are that it should be deeper or wider as it doesn't even fit a smaller sized garbage bag.","58":"The hole to put the diaper in needs to be larger as I am now using medium diapers (I have a 3 month old) and they're on the brink of being too large to fit no matter how compact I make then and how un-soiled they are.","59":"I have no issues w\/ odor but baby poop doesn't start to smell really bad till they start on soilid so odor will not be a problem no matter what till then and that's many many months down the road.","60":"This pail doesn't really keep in odors anymore and we'll probably have to get a new one, but since you can use regular garbage bags (we actually use the bags we get our groceries in because they hang perfectly) its still probably a better deal than the genie.","61":"We just had a baby and were debating getting either this product or the Diaper genie and this is what sold us on this product","62":"We received this diaper pail as a gift while expecting our second child.","63":"and what a Godsend!","64":"It is much easier to fill and unload than the Diaper Genie, plus, why buy refills when you can use trash bags from the Dollar Store?","65":"It also holds a lot more diapers.","66":"look at the size of it!","67":"Any diaper pail, if you leave it for long enough, is going to smell.","68":"I have noticed an odor (one the I expected!) when unloading the Diaper Champ but at least you don't smell anything every time you use it.","69":"unlike the Diaper Genie!","70":"I highly recommend this!","71":"For my first I had a diaper genie which was not only costly with the refills but it was also very stinky.","72":"I would not recommend buying that one.","73":"My second child I didn't get any.","74":"Now for our third child I saw the Diaper Champ and figured why not register for it and try it out.","75":"I have to say that I am very happy with it so far.","76":"I did dump a little deoderizer tablet in it.","77":"I am happy with the fact that I can use any bag in there and dont' have to pay out the nose for replacements.","78":"It's also so easy to use and holds a great deal of diapers.","79":"I haven't noticed any seepage of smells.","80":"My husband and I bought this instead of the Diaper Genie since we didn't want to be bothered with buying refills for the Genie.","81":"Well, I suppose this is better than an open pail, but to have a nursery in which there is no unpleasant smell is quite impossible no matter what you use.","82":"The bags attach inside the Champ easily and all one has to do is cram the diaper down and flip the handle.","83":"Presto!","84":"Diaper falls into bag inside the Champ.","85":"But, sometimes, if the Champ is too full, the flip handle won't function.","86":"(I never know when the Champ is full as there is no way too tell.  Even though not particularly aesthetic, how about making the Champ clear and see-through?) So, I lift the lid and find a wad of diaper, which I must remove, usually stuck inside the lid itself because the bag is too full.","87":"A couple of tips to having a clean-smelling nursery even with the Champ: Double bagging- Get those diaper sacks you would use to dispose of diapers if you're in a place where you don't want to dump a dirty diaper, like in your friend's wastebasket or kitchen garbage.","88":"Bag the diaper in this small clean-smelling bag and then chuck it in the Champ.","89":"Another tip is to wash out the Champ frequently and spray the inside and lid with Lysol after every full bag is removed.","90":"I bought this diaper pail when my son was just a few days old and I absolutely LOVE it!","91":"I used to work in a daycare and we had a diaper genie.","92":"It was such a pain to use.","93":"We all hated it.","94":"The diaper champ couldn't be easier to use.","95":"And the biggest plus is that you don't have to buy any expensive refills.","96":"It takes regular trash bags.","97":"I generally put kitchen size bags in it, but you can use just about any size if you are in a pinch.","98":"And it does an excellent job of keeping the odor contained, which the diaper genie never did!","99":"If you are looking for a user-friendly diaper pail that actually does keep the odor contained, than the diaper champ is the one for you!","100":"It was a PAIN.","101":"Everytime I tried to unload it the sausage links(as I call them) would unravel and I think the odor control was only so so.","102":"it wasn't much different than putting the diaper in a shopping back and putting it in the regular trash.","103":"THIS ITEM IS EXCEPTIONAL I like the ease of use and it held the odor in great.","104":"For even better odor control we would put a plug ins in the outlet closest to it.","105":"I had no problem with stuck diapers and if I did it wasn't often but I can see how it would happen.","106":"Diaper Champ is by far the best diaper pail!","107":"It holds a lot of diapers, not to mention the odor!","108":"It's easy to use (just a flip of the lid, and the diaper is gone!).","109":"It's also easy to empty out.","110":"Just unlock the top, and remove the plastic bag.","111":"And best of all, no wasting money on special refill bags---this takes ordinary garbage bags!","112":"Whether you are using disposable or cloth diapers, this is the truly the only diaper pail to get!","113":"My original purpose in buying the Diaper Champ instead of the Genie was to use it with cloth diapers.","114":"As a first-time mom, I got the great idea that cloth would be better, and this was the only diaper disposal that advertised compatibility with cloth diapers.","115":"She never wore even one- the hospital started me on Huggies, and I never turned back (as a side note- if you do have the patience for cloth diapers, pay the extra $ and go for Kushies; they're beautifully made and work very well from what I've heard).","116":"Even though I never ventured into the cloth land, I was very impressed by how well this works at keeping diapers and their accompanying odor in the pail and out of our life!","117":"Opening the Champ to empty out the bag is a little tricky- I pinched my thumb a few times before I got the hang of it.","118":"Being a very economical person, I appreciate the fact that any plastic bag can be used with this system- I never did like the prospect of buying special Diaper Genie refills.","119":"If you have a really sensitive nose, I can suggest buying some scented kitchen trash bags to use with the Diaper Champ- since the odor is contained in the Champ, once you have to open it to empty out the full bag, you're quite often greeted with a rather unpleasant blast of odor, and scented bags help with that.","120":"As one other reviewer pointed out, it does occasionally take a little effort to push down the \"plunger\" to get the diapers in the pail, even though upon inspection the bag doesn't really look full.","121":"But from my experience, by the time it gets to that point, the bag is really heavy, so I think this is kind of helpful- it's a built-in way of keeping the bag manageable upon emptying.","122":"This is a really great buy, for yourself or as a shower gift.","123":"I'm beginning to think that the main reason Genie's so popular is their cutesy name.","124":"It's certainly not worth the money or the upkeep.","125":"Go for the Champ.","126":"It lives up to its name.","127":"I love this product!","128":"With the enormous numbers of diapers that you go through with a newborn, it was great how easy it was to dispose of the dirty ones.","129":"Plus, the fact that it used regular trash bags is great.","130":"No need to pay for the special refills that the other brands require!","131":"and we still LOVE it!","132":"We have been using the Diaper Genie for the past 17 months and are very happy with it.","133":"We opted to purchase this diaper pail even though my SIL gave us her used diaper pail (the other popular pail. one that uses its own brand of bags) for free--and we are VERY glad we did.","134":"Here's what we love about this pail.","135":"*holds a LOT of diapers--a full week of toddler diapers!","136":"(we wrap them nice and tight) *we use our regular kitchen trash bags--cheap!","137":"*holds the odor in nicely!","138":"(every now and then I spray down the inside of the pail with Lysol) *easy one-hand use *impossible for my inquisitive child to get the dirty diapers OUT of the pail Every now and then odors do escape the pail, but that is rare--and it usually just means that we've crammed too much in there and need to change the bag.","139":"Spraying down the inside of the container (and letting it air out) periodically definitely helps.","140":"We keep the Diaper Champ in our daughter's nursery and her room definitely does NOT smell like dirty diapers.","141":"It holds quite a few diapers, and pops them in quickly and easily.","142":"I use the same store-brand tall kitchen trash bags I already use in the kitchen for it -- no special \"diaper\" trash bags necessary.","143":"The opening could be a little wider, I suppose, but I haven't really seen anything else that could be improved.","144":"It works with a minimum of fuss.","145":"The diaper champ turns the smelly diaper into \"what diaper smell\" in less time than that.","146":"I hesitated and wondered what I REALLY needed for the nursery.","147":"This is one of the best purchases we made.","148":"The champ, the baby bjorn, fluerville diaper bag, and graco pack and play bassinet all vie for the best baby purchase.","149":"Great product, easy to use, economical, effective, absolutly fabulous.","150":"Update I knew that I loved the champ, and useing the diaper genie at a friend's house REALLY reinforced that!","151":"There is no comparison, the chanp is easy and smell free, the genie was difficult to use one handed (which is absolutly vital if you have a little one on a changing pad) and there was a deffinite odor eminating from the genie plus we found that the quick tie garbage bags where the ties are integrated into the bag work really well because there isn't any added bulk around the sealing edge of the champ.","152":"I love this pail!","153":"No smell, easy to use with one hand free, and best of all it uses regular tall kitchen garbage bags so you don't get suckered in to using only the bags made for the pail that are imposible to find!","154":"I have heard that it will eventually become my sons favorite place to put his toys when he becomes a toddler, but I've got 2 years to worry about that and I'm sure I'll figure out preventative measures like any other mom.","155":"4 months later.","156":"OK.","157":"I still like it but don't think it rates the 5 stars I gave it but can't change that.","158":"Once your child goes on to solid foods BEWARE!","159":"Solid food poop is VERY STINKY and this diaper pail doesn't really contain the smell.","160":"I still like it a lot and am not changing it for another, but it is sort of stinky.","161":"I think it's great.","162":"I just wished that it didn't fill up so fast!","163":"It definitely keeps the smell out.","164":"But now that she is eating solids the odor is escaping out and we are constantly using airfreshner.","165":"First 4 months it was in our bedroom and we did not even smell any odor.","166":"Bottom line if you buy this for your newborn, it is fine.","167":"But be prepared to buy something else (diaper genie ?) which can trap the odor better.","168":"Every time!","169":"The diaper champ is the best!","170":"Having used it with 2 children 13 months apart.","171":"I can honestly speak to its worth!","172":"I have tried other pails, but none have compared positively to the Champ.","173":"1) The champ is easy to use.","174":"One pail that I used was so difficult to change the bag and insert the dirty diaper.","175":"You had to remove the entire lid and lay it on the floor (which led to my toddler running away with it which is gross) while trying to fit the bag correctly into the slot.","176":"For diaper disposal, you had to push a button and the lid would or would not pop open.","177":"With the Champ all you had to do was drop the dirty diaper into the opening and flip the lid.","178":"It was so easy my toddler would dispose of her on diapers.","179":"The Champ also has hinges for you to place a new bag.","180":"2) The Champ uses regular store bags.","181":"You do not have to waste money or time trying to purchase special bags for the Champ.","182":"You can save your bags from your shopping trip and insert them into the Champ.","183":"Special bags are expensive, hard to find, and you never have enough.","184":"This will never be a problem with the Champ.","185":"Don't Caregivers need more simplicity in their lives?","186":"The Champ gives you peace of mind and wallet.","187":"3)The Champ is Odor Free for at least 15 months.","188":"The Champ did not start letting a little odor through until well over a year.","189":"I cannot speak to the accuracy of its odor containing capabilities due to it was working overtime with 2 childrens diapers.","190":"If you have only one child the Champ may last you until the child is out of diapers.","191":"The other pail I used started to smell after 2 weeks of use.","192":"Regardless to this fact, I believe the Champ is the best way to go.","193":"The positives outway the negatives.","194":"There probably isn't a pail out on the market that doesn't get smelly after a while.","195":"Let the Champ win you over!","196":"My biggest concern was would this truly control the odor and yes it did.","197":"dirty diapes and soaked diapers.","198":"I only noticed an odor one time and that was because I did not close thelid when I changed out the bag.","199":"No need for deodorizers.","200":"I use the regular kitchen trash bags and it is so easy to empty.","201":"even did while daughter sleep and no noise!","202":"I use the scented bags and even if I don't no smell!","203":"This holds alot and does not take up alot of space.","204":"When my wife and I got the Diaper Champ, we thought that it would work perfectly.","205":"We read the reviews on and saw that people liked it much better then the Diaper Genie, but I'm not 100% sure.","206":"We found that when you put a dirty diaper into the top loader, there was a tendency to get streaks which would then get on the plunger which would then have to get cleaned each time it was used.","207":"We resorted to using small plastic bags to store the dirty diapers and dumping them in a trash can and using the Diaper Champ for wet diapers only.","208":"We also had a problem with diaper wipes getting caught when the top was flipped.","209":"This eventually ruined the foam pad that is applied to the flip top to keep odors in.","210":"I had to go and pull the crumpled foam out just so we could turn the lid.","211":"But like I stated, its better then a trash can, but I'm not sure if its better then the Diaper Genie.","212":"It holds almost a week's worth of diapers, and you don't need expensive refills - any kitchen bags work.","213":"At first I had a problem with some smell, then I realized if you flip the lid back and always keep the same side facing in - then there is no smell at all!","214":"It is also to wipe clean if you do get the chute a bit dirty.","215":"I second that you just need to fold up the diaper (with wipes inside) neatly, but that is not a big deal.","216":"The latch isn't terribly difficult, and I wouldn't want it to be too easy since it sits in my son's room.","217":"She said her sister had the Diaper Champ and that it took regular garbage bags and worked just as well.","218":"Personally, I am VERY pleased with the Diaper Champ.","219":"It is mindless to operate.","220":"It takes garage bags that we use elsewhere in the abode.","221":"It doesn't stink, ever (like some have assumed since it doesn't wrap each diaper into its own neat little cocoon).","222":"And it is very easy to clean.","223":"I can keep one hand on my baby and dump the diaper at the same time, it is that simple.","224":"I am SO thankful I got that advice when I did because I had the Diaper Genie on my registry aforementioned to her warning.","225":"I'd abhor having to drive all the way to a baby superstore to purchase bags her dirty diapers are just going to get thrown away in.","226":"I am very pleased with our choice.","227":"This is a great diaper pail.","228":"There is no odor and it is very easy to use.","229":"(You can do it one handed while still hanging on to the baby.) Also, we like using regular trash bags instead of having to worry about buying refills (like with the Diaper Genie).","230":"And it's the largest diaper pail I've seen without taking up more floor space.","231":"We have both a Diaper Champ and a Diaper Genie.","232":"and we definitely prefer our Champ!","233":"Not only is it much more cost effective (you can use regular trash bags rather than Refills at $5 a pop), it is easier to use and clean, and has a larger capacity.","234":"Only problem.","235":"it can be frustrating and messy when you put that last diaper in before realizing the unit is full.","236":"The pluger gets stuck & you have to manually extract the mess.","237":"I registered for this item because of the good reviews it got, however I was not impressed.","238":"For one thing, The diapers always get jammed in it.","239":"The product also leaves a faint smell in the room.","240":"All in all, the Diaper Champ serves its purpose, but it does not live up to its good reviews.","241":"I got the diaper champ because of the great reviews as well as the fact that you can use regular garbage bags.","242":"It works great.","243":"I can't smell anything (and believe me, this is quite something with my baby).","244":"I ended up buying one for upstairs and one for downstairs because it works so well and because I change him so often downstairs.","245":"It's much better than putting diapers in a downstairs trashcan.","246":"The reviews were definitely right.","247":"We have been using our Diaper Champ for almost 14 months now and we are very happy with it.","248":"It sits in the corner of our bathroom and we have never had any problems with odors at all (and we live in the damp and humid South, where odors of all kinds are generally rife).","249":"It is easy to install and change the ordinary trash bags, easy to clean, and most important, easy to use one handed - just insert folded dirty diaper and flip the handle.","250":"As the bag fills, you may need to flip twice to ensure that the weighted cylinder has completely pushed the diaper into the bag.","251":"For the first 9 months or so, we only needed to empty this once a week.","252":"Now that our son's diapers are a little larger, they take up more space, and we empty twice a week.","253":"We have never had any problems with anything like loose wipes getting stuck (we always wrap them in the dirty diaper).","254":"It is a bit difficult to get the unit open (the advice to take it slowly is sound), but now that our son is walking and exploring, I consider this a positive attribute!","255":"Update (March 2005): My son has been out of diapers for almost 2 years now, but the Diaper Champ hung in there till the very end - easy to use, no problems with odors, and one of the best bargains among all of the paraphernalia required for the modern baby :-)","256":"I originally put this item on my baby registry because friends of mine highly recommended the use of a diaper pail.","257":"I decided to go with the Diaper Champ rather than the more popular Diaper Genie, because I didn't like the idea of having to buy special bags.","258":" Too costly and not efficient if you ask me!","259":"THIS PRODUCT IS A LIFESAVER!!","260":"I HAVE NEVER HAD AN ODOR PROBLEM!","261":"No one has ever come to my house and noticed 'diaper odor.'","262":"In fact, people who have been present while I changed my almost 3 month old son's diaper have been amazed at how the very 'potent' smell of the dirty diaper seems to disappear once I dispose of the diaper in the Diaper Champ.","263":"For those who are experiencing odor problems, here are some suggestions which should solve the problem:","264":"1. CHANGE BAGS FREQUENTLY!!","265":"I change mine about 1 or 2 times a week.","266":"For those who complain that the pail gets stuck, that is probably a good indication that the BAG IS GETTING TOO FULL!!","267":"Also, making sure that the tape on the diapers is secure will prevent that from happening as well.","268":"2. YOU STILL HAVE TO CLEAN THE THING!!","269":"Hello, it does house dirty diapers!!","270":"All I do is wipe it down with some antibacterial wipes (takes about 10 seconds!!) and then maybe spray some Lysol in it and let it air out for a minute or two.","271":"SIMPLE AND IT WORKS!","272":"Also, for those that complain that the Diaper Champ isn't as effective as time passes, keep the following in mind: AS BABIES GET OLDER, THEIR DIETS CHANGES (aka SOLID FOODS!) AND SO DOES THE SMELL OF THEIR DIAPERS!","273":"In talking with other parents, I get the same feedback - as babies get older and become toddlers, ALL DIAPER PAILS become gradually less and less effective until they are just no longer useful.","274":"Again, this is because as their diet changes, so does the consistency and odor of their stool, in other words, it gets stinkier!!!","275":"All in all, this product is definitely one I would recommend and certainly worth the very reasonable price.","276":"I love the diaper champ, it is really easy to use and since you can use regular garbage bags it doesn't cost an arm and a leg for refills.","277":"The only downside to this is that it can get pretty stinky long before the pail is full.","278":"I wash ours out with lysol each time I empty it, and that helps, but when its hot out- well, just be prepared.","279":" We used this diaper pail from the day we brought our son home, until about 13 months.","280":"That's when it went from Oderless, to ODEROUS!","281":"Even when empty!","282":"So, I took it to the tub, scrub it down with disinfectant.","283":"It still smelled.","284":"So then I used straight bleach.","285":"That seemed to work -- for about 3 days.","286":"Then it started to smell whether there were diapers in it or not.","287":"However, for the previous 13 months-this is what I encountered - PROS -","288":"Using your own bags is much cheaper and convenient.","289":"The height is a more convenient reach than others, where you have to hunch over.","290":"Its stable, so a curious toddler can't easily tip it over.","291":"CONS - Difficult to open to change bag-twice my bags caught on a sharp edge inside and snagged as I was pulling out-leaving dirty diapers all over the floor.","292":"Also, diapers tend to stay in the middle, causing the pail to get backed up.","293":"Diapers can get stuck when turned around if you don't tightly wrap them first.","294":"My toddler thought rotating the  top was fun-he always wanted to play with it","295":" (Being a diaper pail, I'd prefer he not be enticed by something so unsanitary.)","296":"I wanted this product because i didn't have to buy special bags for it and it also came highly recommended.","297":"The only problem i have is with the handle you use to open the top compartment.","298":"The way you have to shove your fingers under it and pull is just too tight.","299":"I can't tell you how many times i've chipped a nail or hurt my fingertips because of the force needed to open it.","300":"That would be my only complaint.","301":"This is a GREAT product!","302":"I had never liked the idea of the Diaper Genie because of the refills.","303":"Not only can they be a pain to install, but who needs one extra thing to watch a supply of?","304":"I mean, with babies it's already far too easy to run out of diapers or formula.","305":"I couldn't picture myself yelling to hubby, \"Honey, I know you have sixty other things to get...can you also pick up refills for the diaper pail?\"","306":"The Champ works great.","307":"We use regular kitchen sized garbage bags.","308":"We've never experienced odor from the pail.","309":"It was easy to assemble, and the diapers fit perfectly into the little nook before they make their way into the pail portion.","310":"I also love that you can flip the device with one hand...","311":"Highly recommended!!!","312":"Makes life easier and keeps baby's room smelling like baby, not dirty diapers!","313":"Excellent diaper disposal unit.","314":"I used it in conjunction with Glad 3ply kitchen trash bags with odor control (scented).","315":"I am soooo pleased with this product!!!","316":"A wise investment for the pocketbook & for the nose!!!","317":"Diaper Champ is great.","318":"But just to let you know that I've been breastfeeding and the poop doesn't stink as much as formula poop.","319":"So I can't tell you if Diaper Champ will be as good at containing the formula generated poop smell, but it's excellent at containing the smell of poop of my breastfed baby!","320":"Friends told me that the Diaper Genie did not work very well, so bought the Diaper Champ based on on-line reviews and I have been happy with it.","321":"It works easily with one hand, which is important.","322":"Also, it takes any kitchen sized trash bag, so there is no special bag to stock.","323":"While the perfect ordor free diaper pail has yet to be invented, the Diaper Champ is a good as it gets.","324":"Gets stinky after a few months, the seal on the piston doesn't seal anymore.","325":"Also, diapers and wipes get stuck in the grove below the piston.","326":"Large diapers have to be wrapped tightly.","327":"I gave up and got a diaper Dekor.","328":"Much more hands off and takes any size diapers.","329":"Also much less stinky.","330":"Don't buy the diaper champ.","331":"You will be sorry after a few months.","332":"So far so good.","333":"I was using the cheapie pail...and it worked ok until the opening device fell apart.","334":"I am wondering how some of these reviewers are able to stand having kids?","335":"Even the old pail hardly smelled bad to me, I think after you have changed diapers for 4 years, you get somewhat immune to it.","336":"I could probably use a trash can and be ok at this point, but this prduct seems to work very well so far.","337":"Let me just say this... After being a nanny for almost 10 years I have tried them all.","338":"This one is really great.","339":"I actually took a friends word on it and went with this Champ when registering and I am glad I did.","340":"I just knew all along what products I would not use, but was undecided on the actual one I wanted.","341":"Well the Champ has survived it's first year with our son and it is great!!","342":"We just bought another for baby boy number two coming next month.","343":"The thought of not having to buy refills and just using regular bags is awesome!","344":"We just buy the smaller bags that come like 250 to a roll and are sented and they are like $6.00 and they work great.","345":"We just recently had to buy another roll of bags. SO $6.00 for a year of bags- can't beat that!!","346":"We lysol the champ every time we change the bag out and have not had any problems.","347":"Would reccommend to anyone and everyone!!","348":"Don't listen to the bad reviews!","349":"This is really a nice diaper pail.","350":"I recommend it to both parents of infants and toddlers.","351":"In fact, I liked it so much after using it with my son who is now 2 years old, that I bought one for our new baby's room.","352":"Originally with my son we had a Diaper Genie.","353":"Wow - was that disappointing and we didn't even have it 6 months before it broke.","354":"I bought the Diaper Champ and have been very happy for the following reasons.","355":"1.  The Diaper Champ doesn't require special refills that are expensive and hard to find!","356":"We just use the Glad tall kitchen trash can bags with odor shield from Target and they work wonderfully.","357":"We don't have to worry about running out of refills with this diaper pail!","358":"2.  It can be operated with one hand - Leaving a hand on your baby on the changing table.","359":"So much safer than the others that require a two handed operation!","360":"With them, you have to put your baby on the floor or someplace else safe just to put the diaper in the pail.","361":"The Diaper Champ is so simple that my toddler loves to put his own diapers in the diaper champ and flip over the handle.","362":"He thinks it is magic when the diaper \"disappears\".","363":"3.  Bags are easy to change.","364":"Pop the lid, fold it back on its hinge, pull the trash bag through the ring, and take out the dirty diapers.","365":"To replace the bag simply open it up and feed the top of the bag through ring, fold it over the sides of the ring, and close.","366":"It takes all of 2 minutes, if that.  4.","367":"It keeps smells out of your nursery or toddler room!","368":"Yes, you may get a whiff of a smell when you flip the handle, but then it is gone.","369":"Remember, it does hold dirty diapers!","370":"To eliminate any smells we simple stuck a Stick Up room deodorizer inside the lid.","371":"Now when you flip the handle you get the Stick Up smell instead.","372":"Works great!!!!","373":"5.  The price is right.","374":"At $30 we put one in the nursery and one in our toddler's room."}