{"0":"The world of MP3 players is blinding, and since most people don't understand the technology [myself included], user-friendliness is EXTREMELY IMPORTANT.","1":"Unfortunately, Creative offered scant few pages of instruction, which meant that I was on own from the outset.","2":"After attempting to navigate the clumsy touch-pad system, I could not get the unit to download my wma files.","3":"When most of us purchase these little devises, we do so because of their diminuitive size and extraordinary storage capacities.","4":"SO, YOU MIGHT INQUIRE, WHY DON'T THEY MAKE IT A FIRST PRIORITY TO CAREFULLY, SIMPLY EXPLAIN HOW DOWNLOAD MUSIC FROM YOUR MUSIC LIBRARY TO THEIR DEVICE??? This seems academic to me.","5":"Most of us just want to plug and play, not spend a year navigating a maze of complicated options...like transfering everything on a hard drive to this stupid thing.","6":"I don't care what ELSE it can do.","7":"I just want MUSIC to eminate from it when I want, how I want.","8":"All of this said [as it's on it's way back to Amazon], the one song it did include provided far better sound than the IPOD.","9":"The base was deeper and the highs were crisper.","10":"Unfortunately, the touch-pad issues [non-intuitive] and poor instruction guide killed it.","11":"Why get locked in to crappy Itunes weather you want to or not?","12":"what a kick butt Mp3 machine and the freedom to get songs from a reasonable source, instead of paying for them two or three times, then get the Creative Zen IPOD killer, kiss my ass Itunes!","13":"i got 6000 mp3's you'll never register or gay up.","14":"Two days after writing this review below, I want to remove another two stars.","15":"I just discovered another con in my list of pros and cons.","16":"This one is particularly bothersome: Allegedly one can use the Zen Micro as a portable drive to store and transport data from one computer to another.","17":"Ahhh! There is a catch, the manufacturer does not tell you.","18":"Although you can store any type of file on the Zen Micro to download onto a different computer, you need to INSTALL (on the computer you are moving the data to) Zen Micro software and drivers to do it!!!","19":"I just tried to move a load of plain data files from my home computer to my office work computer, and it is promting me to install Zen Micro software, etc....","20":"I have used similar devices and they are seamless and simple.","21":"Who wants to go through the hassles of loading software onto a \"foreign\" computer just to move over some simple (*.txt) files?","22":"This brings my review to one star!","23":"But Amazon won't allow me to reduce the number of stars once I have already established three two days ago.","24":"The sound is great, the portability, etc... all the \"stuff\" you expect from a good MP-3 player, this Zen Micro has it.","25":"It COULD have been a great product.","26":"Why isn't it?","27":"Read the next six mixed pros and cons: .","28":"1.","29":") Button sensitivity: Even reduced to the lowest sensitivity setting, the buttons are far two sensitive, really takes some getting use to, and even then, it is still too sensitive.","30":"The company has received thousands of complaints about this and refuses to do anything about it. .","31":"2.","32":") WORST FEATURE POSSIBLE, THIS ALONE MAKES IT RATE ONE STAR: What's up with no recharge cord?","33":"You have to purchase that separately for some outrageous cost.","34":"If you want to recharge it, you MUST connect it to your computer.","35":"The recharge cord will do the job in a fraction of the time that the USB cable will hooked to your computer.","36":"I took my Zen Micro with me over the weekend, and was forced to lug my laptop with me on the trip for one reason: to keep the Zen Micro charged.","37":"Infuriating! Nearly all other MP-3 producing companies include a recharging cord with their product that can be plugged into a wall socket.","38":"If you want a wall-socket recharging cord, you have to dish out somewhere between $30 and $35, plus shipping and handling, for a cord that cost less than $1 to manufacture and market.","39":"I have trashed this product on other opinion sites based on this major flaw alone.","40":"What is up with nickle and dimeing consumers on the recharge cord?","41":"Buy from another company and run from Creative, Inc.","42":"Their product may appear more enconomical, but it isn't in the long run. .","43":"3.","44":") Creative, Inc. the maker includes the barest of the bare minimum in the box, then through gross profiteering nickles and dimes you on EVERY single accessory at extraordinarily inflated prices.","45":"The box included a little polyester, pull-string BAG, (yes, you read right a BAG, something a boy would carry ten marbles in) and tries to pass it off as the case.","46":"If you want to purchase a real case or container or clip-on carrier for you Zen Micro, expect to purchase it separately and to dish out big time. .","47":"4.","48":") One outstanding positive feature is the battery. It holds a charge for a long time, longer than most other similar products and the user can replace it easily or take another along as a backup.","49":"Some other companies require you to send your player back and then charge you an additional $130 to replace their batteries.","50":"Creative did well on its rechargeable battery feature. .","51":"5.","52":") I purchased this device primarily to record off the built-in FM receiver for lectures and seminars that are broadcast live over a FM signal for the hearing impaired.","53":"The Zen Micro FM receiver is ok, not great.","54":"IRiver has a better FM receiver built in, but the drawback to IRiver products is they are flimsy and poorly constructed.","55":"I have gone through two of them in two years. .","56":"6.","57":") The Zen Micro appears sturdy and well constructed, hefty, if you will, far better than many of its competitors. .","58":"As I wrote, this COULD have been a great product, but expect hidden charges (read gross profiteering and price gouging) as the company royally sticks you on every conceivable accessory necessary for normal daily usage.","59":"Well, I have an Ipod mini - and I really like it, but all in all, I like the Zen Micro more.","60":"  Why?","61":"Smaller size, 1 gb of more space, radio, voice recording, removable battery, cooler look, all in one.","62":"The touchpad is annoying sometimes (give me the click-wheel and pressable buttons any day), but not at all as difficult to get over as other people are saying.","63":"I love how small the thing is, and the blue glow - I've had it for two weeks with no electronic problems at all.","64":"Creative Media Source is very easy to use once you get the hang of it, and the file transfers are fast.","65":"Sound quality is great, fm tuner is fine, as is the recorder.","66":"This is the mp3 player with everything I need.  As long as it lasts me a good three years, I'm satisfied.","67":"I am one of the many people who (a) are PC Based and (b) can't stand to see the multitudes of people with those funky white headphones that belong to Ipod users.","68":"I first want to say that I think Apple is making the same old mistake as they did with Macintosh years ago.","69":"This proprietory software to download.","70":"(That was a major turn off).","71":"I am the type of person that will always go against the masses of blind followers so there was no way I was getting an Ipod.","72":"Also If you want a device that does soo much more than the Ipod mini but is at the same price, this is the player for you.","73":"The reason why I didn't give the Zen Micro 5 stars is that they also seem to want to conform the the Ipod sense of style.","74":"and supply those stupid white Headphones.","75":"I also think that if you are going to offer them in different colors then commit all the way and have the entire device in that color, not just the front and color the head phones as well.","76":"Let's face it.","77":"Apple is Apple.","78":"So Creative should be \"Creative\".","79":"I've been looking for a portable MP3 player for awhile now.","80":"With so many choices it was a tough decision.","81":"My first instinct was to go with an iPod.","82":"I visited quite a few forums and while the iPod is a great player I was concerned with the battery life and the inability to change them without breaking open the case.","83":"I started looking at the Creative Zen Micro and after reading numerous reviews from message boards and magazines I decided I'd give the Zen a try.","84":"All I can say is what a wonderful choice!","85":"I ordered from Amazon and got the Limited Edition package that includes a free battery!","86":"Upon opening the box I was confronted with this small cute little MP3 player.","87":"I popped one of the batteries in and to my surprised it started right up.","88":"The software included is an easy installation and you have the option of using the Creative software, Windows Media Player 10, or simply Windows Explorer to move music back and forth between your Zen Touch.","89":"I did a quick test by selecting a few files and copying them over and they loaded right in.","90":"Pressed play and I was off.","91":"The touch pad does take a little getting used to.","92":"I'm still trying to manage the thing myself, but I've found that if you put the sensitivity to low it is fine.","93":"The package also comes with a USB cable, an AC adapter, a pair of headphones (they're okay until you get a better pair), a stand, and a microfiber pouch to carry your Zen Touch in.","94":"Overall I'm incredibly impressed with my new Zen Touch.","95":"It's cute as anything and the glowing blue LED looks super cool around the edges.","96":"For the price I think this is a remarkably fun MP3 player.","97":"Enjoy!","98":"I've had this player for more than 4 months and I'm very happy with it.","99":"I use it on an average 5 hours a day I hook it up to my Belkin FM transmitter in the car or to my Logitech 2.","100":"1 Speakers at home, I rarely use it with the earbuds, though they are much better than the ones you normally get with other mp3 players.","101":"The Look & Feel: I have the black one and the contrasting neon blue on the buttons add a very nice ambience.","102":"The light pulsates when you are charging it almost as if it were breathing.","103":"The player itself is tiny , it gets a bit bulky when you put it in the hardcase, which you need to do if you don't want to get scrathes on the back(its a nice looking back too ).","104":"It feels tiny in the hand without it.","105":"The stand that comes with it is very useful to prop it up on the desk.","106":"The belt clip however is not very useful if you move around a lot.","107":"The blue backlit LCD looks really neat and is easy to read.","108":"The touch controls took a little getting used to but now I wouldn't change it for the scroll wheel.","109":"The touch buttons are textured so that your finger sdon't slip which was very thoughtful.","110":"Reliability & Build  I dropped the player once from about 4 ft, and it fell hard, but kept on playing.","111":"The hardcase they give with it must work well.","112":"It feels solid and not flimsy like the carbon.","113":"Sound  I'm no audiophile but I was amazed by the clarity the player had, it was much better than the sound card on my Computer and louder too.","114":"I have had the ipod mini and it performs on the level with my sound card but the micro beats it outright.","115":"Best of all the WMAs(I have a lot of them) sound great.","116":"Utility Its got a huge list of features including an FM Recorder a Calender and contacts list.","117":"Its not convinient to enter name of course but synchronise it with outlook and it becomes a gem of a address book.","118":"The songs recorded with FM are as good as the original signal.","119":"The interface takes 2 secs after you press record to show up but its actually started recording at the moment you press record.","120":"Software The software that comes along with it is not very intuitive but once you are used to it,it  does the job well.","121":"Creating and modifying playlists is easy and clean.","122":"There are 2 things that need fixing  First is the battery life. It will run for 6 hrs without problems with medium usage of the buttons.","123":"Second might be a problem I might have with my PC but not too sure, when the player is connected on the USB and I start playing on it and also using the windows explorer, it sometimes pauses by itself and tries to synchronise with the PC during play, which is a bit irritating.","124":"I think that for its price compared to the ipod the creative zen is pretty good.","125":"i have a lot of files in wma so that was the biggest factor in my decision to purchase the zen.","126":"HOWEVER after just one month my headphone jack was BROKEN as a result of normal, every-day use.","127":"by broken i mean that it would no longer transmit sound.","128":"The good news is that the creative support is very responsive and after some emails and postal exchanges, i had a new zen.","129":"i havent used it much yet so i dont know if i will have the same problem; obviously i hope not.","130":"i dont especially like how music files are unstructured; basically they are just dumped into one folder with no organization, like you might have in windows explorer folders and subfolders.","131":"in principle playlists, album names, artist names, etc would help you organize but this only works IF your tracks have all the necessary data; mine do not.","132":"and if you have 2500 songs, as you might very well, you will be reluctant to edit the clip properties of 2500 files.","133":"the sound is quite good, in terms of volume.","134":"the headphones are not very comfortable, but most people have a certain style they like so just go buy new ones or keep the ones you have.","135":"i didnt have any installation problems; and the touch pad is fine, even if it is sort of inaccurate.","136":"you just get used to it after a while.","137":"i didnt get ipod because i dont especially like itunes (no music i want, but thats just me) and the creative product was cheaper; and i needed to be able to use WMA files.","138":"all-in-all, its good enough for its price as long as it doesnt break again due to normal use.","139":"This is a difficult player to review because I would recommend it on a case-by-case basis.","140":"If you're not computer savvy or if you want things as simple as they can be, get the iPod.","141":"Bottom line.","142":"However, since you're reading this review, you want to avoid getting an iPod.","143":"For whatever reason. There is also a low number of people, like me, who love iTunes but want to get the Zen Micro.","144":"I'll talk more about that later.","145":"First of all, why does every single piece of media library software that comes with an MP3 player suck?","146":"(iTunes being an exception of course).","147":"The Creative MediaSource software that comes with the Zen Micro is cluttered, and excludes my favorite feature in iTunes, the ability to automatically copy everything you import into a certain folder.","148":"I like to keep all of my Mp3s in one folder and manually doing this is a pain.","149":"Bottomline, don't even bother with the software that comes with the Zen Micro.","150":"NAGATIVES of the Player itself:  You need to do a little work before having full enjoyement of this player.","151":"1.","152":"Set the sensitivity of the touch pad to LOW.","153":"Also, as soon as you select a song and set your desired volume level, put the player on HOLD.","154":"Even on the LOW sensitivy level, a slight touch can skip or pause the track.","155":"2.","156":"Update the firmware which can be found on the Creative web site.","157":"This fixes some glitches such as the player freezing.","158":"POSITIVES:  Reasons for getting the Zen Micro instead of the iPod:  1.","159":"The battery is removable.","160":"You can buy a new battery for 49.99.","161":"With the iPod, if the battery has reached it's life span (after about a year), and you didn't buy the warranty from the store, you need to buy a NEW player.","162":" 2.","163":" FM radio built in (Howard Stern).","164":"3.","165":"Record memos using the built in microphone.","166":"4.","167":"The player looks SO much better when you're actually holding it.","168":"The photos don't do it justice.","169":"The back of the player is nice too, with water ripples inside the clear white coating.","170":"5.","171":"You can use it as a storage Hard Drive.","172":"Now, about the iTunes.","173":"I have no problem using iTunes with the Zen Micro (in a makeshift sorta way).","174":"This is what I do:  I copy all the music I want to import to the Zen Micro into an iTunes play list.","175":"After that, you connect your Zen Micro and open My Computer.","176":"Click on \"Zen Micro Media Explorer\" and then click on \"Transfer Data Between PC and Device\" after that, a File Explorer window opens.","177":"And all you do is select all the tracks in the iTunes playlist and drag them to the File Explorer window.","178":"It's not as seamless as if you were to use an iPod, but it only takes a few seconds longer.","179":"So yeah, you can have the best of both worlds.","180":"* Of Course, if you've BOUGHT tracks from iTunes, this won't work.","181":"You can only copy songs you've downloaded for free or ripped from a CD.","182":"**I honestly don't see the point of buying songs from iTunes when there are so many free alternatives.","183":"But if you get that \"fuzzy legal feeling\" from paying for songs, at least buy them from allofmp3.com, there are no restrictions and the songs cost pennies.","184":"I'm addicted to music.","185":"I'm also somewhat of an audiophile.","186":"Mp3 players are like a blessing and a curse for people like me.","187":"On the one hand, you have the ability to store and plays over 1000 songs on one little piece of machine.","188":"On the other hand, you get terrible sound quality.","189":"I decided to go with the convienence factor and purchase a creative zen micro.","190":"I was at [random electronic store], browsing through players, and came across two that made the cut.","191":"The first was an ipod 5gb (I could kick myself for not buying it), and the other was a creative 5gb.","192":"The creative came with a free trial of [random file sharing company] \"to go\".","193":"So that's the one I bought.","194":"Too bad.","195":"First thing I noticed was that the creative wasn't well made.","196":"One drop from a pocket or desktop, and it'd be a goner.","197":" Problems with the sound quality were evident right away, but even I couldn't imagine they'd be that bad.","198":"The eq is awful, and even at top volumes, the bass is flat sounding.","199":"Cranking the master volume level up past the mark of the bar only leads to distortion and compromised sound quality.","200":"The headphone jack gave out after only a couple weeks of use, and the stock earbuds were replaced same day with some high end sony's I'd been having.","201":"They didn't really make any difference.","202":"I also experimented with an adapter for the car.","203":"If you've been listening to cd's in your car for awhile, dealing with the drop-off in sound quality may take some getting used to.","204":"However, if there was one thing I liked about the creative, it would be the car adapter.","205":"Hands down, better quality than ipod's.","206":"that isn't saying much, but hey, I like to be positive.","207":"Even after all the nightmare sound problems, I'd still half-way like this product if it kept it's promise; the ability to store 1500 songs.","208":"I got about 700 loaded up before it told me I was full, and at that point, I was ready to toss it out the window.","209":"If you do not care about sound\/music quality in the least, and don't mind the ability to store 800 songs less than promised, get the creative zen micro.","210":"Otherwise, you should get an ipod.","211":"My friend has an ipod, and although the sound quality probably won't meet most audiophile standards, the product itself is better than anything creative has made.","212":"features[-][u][cc]It hold's a promised amount of songs, and the headphone jack\/volume controls deliver a more impressive performance than creative's.","213":"If you're an audiophile, you already know that mp3 players are far from impressive.","214":"player[-][s]However, this one makes an ipod sound like your old LP's, so even if you're a casual listener, I'd advise that you avoid the purchase of this product. Terrible.","215":"I bought this two months ago at a local retailer, after spending considerable time reading reviews here of this and other 5GB players.","216":"While they all seem to have their own positives and negatives, I picked the Zen Micro over the Ipod mini, because I am not an Apple person, never has been - I wanted something that is fully compatible with Windows Media Player.","217":"Also, the WMA compression format is superior to MP3, especially at lower bit rates, so I needed a player that could handle WMA and integrate well with my Windows XP computers.","218":"I was fortunate to get the packaging that still included all the accessories (desk stand\/hard case, belt clip, wall charger, etc).","219":"And so far, I have been very, very happy with my Zen Micro.","220":"It's being used daily and I have had none of the problems reported by other reviewers (headphone jack, player locking up, etc).","221":"Just in case, I bought a two-year extended warranty for about 15% of the purchase price of the player.","222":"I promptly gave the included earbuds to my wife, I'm using a pair of Sennheiser PXC250 noise-canceling headphones with the Zen Micro.","223":"The Micro has an impressive array of very nice features and a well designed user interface.","224":"What I like the most:  - Small and solid feel.","225":"The Zen Micro is smaller than it looks in pictures, and feels very solid.","226":"The blue backlight is pretty cool.","227":"The screen is clear and readable, and the touch pad works very well, it took me less than a day to get the hang of it, and now I like it better than having to click buttons or fiddle with a separate volume control.","228":"- Great sound! I was very impressed, I encode at 192 kbps and the audio quality is great, especially with the better headphones.","229":"I managed to fit about 700 tracks on the player, but many of those are 6-15 minute long classical tracks.","230":"- Integration with Media Player.","231":"The first thing I did was upgrade the firmware to the version required for WMP10, it syncs flawlessly with Media Player and transfers are fast.","232":"- Replaceable battery.","233":"A must for me, the fact that you can carry extra batteries is a big bonus.","234":"- The FM Radio.","235":"I find myself listening to the radio a lot.","236":"You have to be in an area with good reception, but where I live I can get most of my favorite stations quite well.","237":"- Doubles as a removable disk drive.","238":"With the right firmware, drag and drop to and from the player like any other jump drive.","239":"I have not yet used all the features, like the calendar, etc, but as a music player this little thing rocks.","240":"The only reason for not giving it 5 stars: the claimed battery life of 12 hours is very optimistic - possible maybe if you really sit down and listen continuously for 12 hours without ever touching the player, but in real life I can probably get 6-8 hours at most.","241":"Plus, from the Creative discussion forums it is clear that they have some problems with excessive battery drainage with the current firmware.","242":"They seem to be working on a fix and will probably sort it out soon.","243":"For me, I get through a typical day's listening just fine, and I could probably squeeze out two days, but it really is no big deal to just charge the Micro overnight.","244":"Even the \"shorter\" battery life, though, has not impaired my positive experience with the Zen Micro in any way.","245":"If you can get one with all the accessories and a cheap extended warranty, this is the player to get! Highly recommended.","246":"Update 8\/11\/05:  The latest release of the iPOD firmware fixes teh calender sync bug i noted below.","247":"I bought this a couple of months ago after researching all the reviews comparing with the iPod mini.","248":"The Micro seeemed like an iPod for less.","249":"I got rid of my older PDA figuring that since the only function I used on it anyways was to manage my contacts and calender, I could now use my Zen Micro.","250":"Pros: - Excellent sound, even with the headphones that come out of the box, but it absolutely rocked with my Bose Quietcomfort 2 set.","251":"- Looks sleek, compact, has a radio.","252":"Limitations: - Not a lot of original accessories like the iPod.","253":"I waited for Creative's FM transmitter for a month, finally bought a Belkin Tunecast II, which is not great.","254":"I get occasional hiss while driving.","255":"- The battery life leaves a lot to be desired.","256":" Though rated at 12 hrs, I could barely manage 8 and I have two spares as well.","257":"I downloaded the new firmware which was supposed to take care of the problem, but it hasn't worked.","258":"- The outlook synch only works for non recurring appointments, which personally is very annoying to me but probably wont be to most people.","259":"Several people complained about the touchpad and frankly i'm starting to see why.","260":"I occassionally flip songs while working out as i accidently hit the pad even lightly (yes i have it in maximum desensitized mode).","261":"I wish they has a \"lock\" function like cell phones to prevent this.","262":"- Not compatible with Audible.com books.","263":"Overall, it does its basic function very well, but we expect more from the mp3 players today and the Zen Micro does not rise to the occassion.","264":"I first signed up for Napster on line.","265":"Loved the service so much I decided to buy an MP3 player and upgrade from the basic Napster to Napster To Go.","266":"They have a list of compatible players which I miss read.","267":"So my first MP3 player purchase was incorrect.","268":"To transfer songs requires you to pay 99 cents.","269":"The player I first purchased was the Creative Nomad Jukebox Zen Xtra 40 GB MP3 Player.","270":"This player is not compatible with Napster To Go.","271":"The player was large and bulky.","272":"The buttons are located on the sides making it difficult to use.","273":"The plus was the storage size but I didn't like hearing the hard drive spin.","274":"I also hated the packaging, with a passion.","275":"It was one of those plastic glued containers that can take you thirty minutes to open.","276":"Accessories were cheap looking.","277":"The player was not very appealing either.","278":"All this before I found out the bad news.","279":"Finally I upgraded the firmware and log in to Napster.","280":"Upon logging in I received a notification that my player works with Napster but not Napster To Go.","281":"It was time to exchange it for the other player the Creative Zen Micro 5 GB MP3 Player Black.","282":"Its a few bucks more and has only 5 GB's of storage but its well worth the trade off.","283":"This is Creative's attempt to compete with the IPod mini.","284":"To bad Napster software is not compatible with Apple IPod's.","285":"Its my first purchase choice.","286":"Actually only three players are on the list for Napster To Go.","287":"Don't worry this player rocks.","288":"It was also the most appealing.","289":"Immediately you could tell a very distinct difference between the two Creative MP3 players.","290":"For the Zen Creative focused on packaging which looked well thought out, well presented and easy to open and put back together.","291":"I keep boxes for all my equipment for storage and moving.","292":"It has a cardboard slip cover with a nice layered box casing inside.","293":" You will find a small folder\/envelope on top along with the player.","294":"Accessories are in reusable bags unlike the Nomad which requires you to tear each back plastic store bag open.","295":"A distinct IPod relation is evident with white colored cables, power plug and the very nice Zen case with a white rubber inside covering.","296":"It has Apple insipid written all over it.","297":"I do give create to Creative for their attractive design.","298":"Creative has put a lot of effort into making this player appeal to those true geeks that search for coolness and functionality in electronic devices.","299":"Creative was defiantly giving the IPod a run for their money with this device.","300":"It makes the Nomad I purchase feel and look like junk.","301":"Everything shines of quality.","302":"I was more excited about this player upon opening than I was about the Nomad.","303":"First I removed each piece and laid them out on my coffee table.","304":"I am now staring at an array of stuff including Zen Micro player, stereo earbud headphones, a rechargeable lithium-ion battery, an AC\/DC power adapter, a USB 2.0 cable, a belt-clip, a stand, a stylish cloth pouch, an installation CD, a quick-start guide, and Creative MediaSource software.","305":"Next I wanted to update the software, after a quick firmware upgrade the player was ready to go.","306":"I sync the player with Napster software and it downloaded the library I had already created.","307":"My PC only supports USB 1.0 not the 2.0 which is blazing fast.","308":"So the download was much slower.","309":"The interface works great.","310":"I enjoy getting use to the touch pad.","311":"In minutes I was easily navigating through the menus.","312":"What impressed me most was the sound.","313":"At 128 the songs sound very good.","314":"My hobby is home audio and home theater.","315":"The Zen lives up to the audio quality I love and expect.","316":"The Earbuds are great headphones as good as my AGK Studio 240, well not as good but darn close.","317":"Creative says that the software engine for this MP3 is the best hands down.","318":"I believe them.","319":"Overall this play is my introduction into the market.","320":"The Zen was an impressive purchase and I would highly recommend it to anyone using Napster.","321":"If you're an itunes person then no one could argue against an IPod.","322":"I got my Zen Micro last week.","323":"I absolutely love it.","324":"It's so small.","325":"It looks sleek and modern.","326":"It holds plenty of songs.","327":"The sound is amazing.","328":"The menu is easy to use and understand.","329":"I love the touchpade controls.","330":"They're easy to use.","331":"The radio and voice recording are nice.","332":"The earbud headphones are really nice.","333":"The battery has a long life.","334":"It's rechargable and supposedly easy to replace though I haven't had to do it yet of course.","335":"The file ripping\/transfering software that comes with the player is easy to use.","336":"It's faster than WMP.","337":"So far I have no complaints with this player.","338":"If anyone is thinkning of getting an ipod mini, forget it and go with this player.","339":"It's cheaper, holds more songs and is smaller.","340":"If you are like me who wants move to the next phase of portable audio from conventional portable CD players I hope you find this usefull.","341":"Space : 5GB =2500 songs.","342":"If you have a huge CD collection, 5GB can hold only a part of your CD collection.","343":"Remember mp3 format lets you store tons of songs.","344":"I have stored 40 audio CDs and i still have close to 2.8 GB free.","345":"User Interface: The software is simple and straight forward.","346":"Havent read the manual till now (remember I am good time computer user).","347":"PC software that comes with the player is not as simple as i Tunes but its not bad at all.","348":"The scrol bar agian takes some getting used to.","349":"You can use the player to store your computer data files (Good feature to have).","350":"Battery : A Big Big plus.","351":"Most of the other players I checked dont have user servicable battery.","352":"Zen micro does.","353":"I have two spare batteries (brought on ebay for 28 bucks each).","354":"Remember this is a huge plus when travelling.","355":"Each battery lasts about 10-11 hours.","356":"If one battery drains just snap the spare one and you are back in bussiness.","357":"Another good feature is that you can charge the battery by just connecting the player to your computer using the USB cable.","358":"FM tuner & Microphone : Having a tuner in the player is a blessing.","359":"Dont have to switch to another device for FM tuner.","360":"Since zen does not have an external antena it has some problems catching weak signals but it works.","361":"Builtin microphone is great for recording short voice notes.","362":"I have heard in other players these have to be brought separately.","363":"Sound: This is where I love Zen the most.","364":"Excellent sound I mean the player has juice.","365":"I dont use the headphones that come with it instead I use Bose Triport headphones.","366":"The player has great potential (ur experiance may differ based on your headphones).","367":"The bass treble the sound detail is awsome.","368":"I compared it to other CD players (Two models of Panasonic, Rio & samsung) and they were no way even near Zen Micro.","369":"Looks and shape: I have a black one and the first time I charged it and switched it on jeez the blue light looked so cool.","370":"Its compact and has rounded edges.","371":"Fits well in hand in trouser pockets.","372":"Freebies you get: A cradle with detachable stand and belt clip, some thing very handy and useful.","373":"I dont use the belt clip cuz it fails to hold the player securely (design problem).","374":"Instead I use a cellphone cover with a belt clip and it works just fine.","375":"You get a USB cable headphones, a pouch, software except headphones you will like every thing else.","376":"What I dont like: Nothing much except Headphones, Belt clip design.","377":"Creative has not lounched any silicon cover for the player like ipod's (I think belkin makes it for ipod).","378":"Stuff you may need to buy: Wired remote from creative.","379":"This is a must have.","380":"Spare batteries incase  you need some extra hours without charging.","381":"FM transmitter (belkin has a good one) to use Zen with your car Sterio FM Tunner   Latest Find: Connected this baby to my $3800 audiophile audio system and it produced clean sound compared to Ipod.","382":"Tested with the same mp3 for benchmarking","383":"I can't help but feel peeved by the attitude created by Apple enthusiasts that basically detracts from anything that attempts to compete with Apple products in the marketplace.","384":"Thankfully, Creative has come through with a product that puts the Ipod back in its place.","385":"While I have not had the \"privilege\", as many call it, of owning an Ipod, based on the experience of friends who have had some misfortune with their Ipod (and subsequently purchased the Zen Touch or Zen Micro), I can pretty much rest assured that my decision to purchase the Zen Micro was one of the more informed ones.","386":"Nevertheless, I still get shirked when someone out of ignorance states \"But it's not an IPod!\" or \"Never heard of it, I'll go with the IPod\".","387":"  About the hype:  I must applaud Creative for their restraint.","388":"By focusing exclusively on quality rather than excessive marketing, they have introduced a player that can look the Ipod straight in the eye and not flinch.","389":"While I'm not too keen on their customer service (none of the products I have from Creative have given me issues), I can definitely recommend the Zen Micro for the simple fact that it does exactly what it is supposed to do and more...without needing any of the extra hype except word of mouth.","390":"Apple, on the other hand, seems to have engaged in a blind marketing strategy that seeks to obliterate competition through utter abuse of marketing channels and un-orthodox \"free player\" schemes that just seem to pimp the product without pimping the features.","391":"The result, while naturally encompassing the acquisition of greater market share, is a mediocre product that stands out sorely in terms of quality and value when compared in a virtual vacuum to its competitors.","392":"About the product:  The Zen Micro is a sleek, stylish device that caters not just to \"hip\" youngsters but to people of all walks of life who like to listen on the go without having to worry frequently about battery life, size, or the \"awkward\" factor.","393":"It fits comfortably in my shirt pocket and while very well-designed, doesn't look to ostentatious while I'm walking around with it.","394":"The interface, while a bit confusing at first, is very easy to navigate after about 15 minutes.","395":"Battery life is exceptional, lasting longer than the 8-10 hours that seem reasonable with most music players on the market.","396":"Transferring files couldn't be easier thanks to the included software bundle.","397":"Also, I am quite partial to the Creative MediaSource Organizer and Player software, which I had with Audigy ZS sound card originally; it is definitely an added plus.","398":"All-in-all, Creative has definitely come up with a winner in terms of product design and features, and I look forward to the Nomad\/Zen line of products seizing more market share as people begin to realize that quality is a better determinant of experience than quantity and hype.","399":"P.S.  The only snag I encountered while initially configuring the device was trying to hook up the Micro to a front USB port.  The bus for the front port on my motherboard did not have enough power; after connecting it to the rear ports, it works perfectly.","400":"This device looks pretty nice but it's really not very competitive.","401":"The iPod mini is smaller and sexier, albeit limited in supported formats and the Rio Karma is a far better value.","402":"The karma is only $5 more, it's small, had a 20 gig drive and supports more formats including ogg.","403":"The karma doesn't look as sexy but it's interface is very efficiently designed.","404":"In fact, it's much better than the iPod in that regard.","405":"The karma also has a very long battery life.","406":"Having owned both the karma and other Creative Lab products (including Zen) I would have to say the Karma also sounds better.","407":"No comparison in my opinion.","408":"Initially, I was very impressed, after loading 180 songs it seemed to function very well but then it would lock up on me and a battery removal remedied this, I then downloaded the upgrades and everything seemed to be alright.","409":"After a week I tried to load some more songs and delete a few but the auto load didn't do anything but turn on my player.","410":"I tried to figure out another way to load the songs and attempted another upgrade with no results.","411":"I emailed the company and after 2 days was told to read their Q&A site and then download again.","412":"I tried the help menu that referenced GUI buttons that don't exist on my version.","413":"I'm less than satisfied.","414":"It seems like the software is just not responding.","415":"The support has been less than impressive, considering the cost.","416":"They responded -after I told them I have a Zen Micro and suggested that my \"jukebox\" needed to be purged.","417":"I'm going to try to get a refund but considering all the hoops I jumped through (emails, downloads, reboots, a purge and another download, plus reading through the help menu) a refund should be twice as frustrating.","418":"After narrowing my choices down to the Zen Micro or IPod Mini, I read countless reviews on both for about a week until my eyes practically started bleeding.","419":"I really like both of them and as with any other popular products, they both have their share of negative reviews warning of their shortcomings.","420":"When I finally couldn't take it anymore, I decided to pull the trigger on the Zen Micro.","421":"The extra GB of hardrive space, removeable battery and FM tuner, as well as the fact that I was previously a satisfied owner of the Nomad II put it over the top for me.","422":"Not to mention that everyone else at the office has an IPod, so I was kinda' hoping for a good alternative.","423":"Fortunately for me, I have yet to have a single problem with this player.","424":"After reading the reviews, I was all ready for the unit to lock up on me after the initial charge...but it never happened.","425":"I think the OS and controls are very well thought out and although I'll admit I was a bit intimidated during my first few hours with the Micro, the interface and controls became second nature after the first day or so.","426":"My preference for the touchpad sensitivity setting is 'medium'.","427":"One reviewer made what *I thought* was a good point about the volume not having an independant control and being buried in a menu, but must not have spent very long with the player because if you slide your finger up or down the center touch button during a song, the volume goes up or down accordingly.","428":"A few reviewers have also complained about the printed manual which is probably one of the biggest wastes of paper ever included with an electronic device.","429":"However, there is a more detailed PDF manual on the CD (and online) that should answer any questions about the operational features of the Zen Micro.","430":"While the software may not be as easy as I-Tunes, it is not difficult to use by any stretch.","431":"As opposed to the Nomad II or any other flash based player, the songs load extremely fast...about one or two seconds per song.","432":"I also like the fact that you can edit your MP3 titles, etc.","433":"after they have been loaded into the Zen which is something I've had to do many times already.","434":"After comparing the included Creative earbuds directly against my Sony MD-E828LP's and Sennheiser MX-400's, I find myself still using the Creative's, which in my opinion, sound every bit as good and have a slightly longer cord.","435":"If I was pressed to find a negative aspect of the Zen Micro I would probably have to mention weak FM reception, but the building where I primarily use the Micro seems to have a history of terrible radio reception anyway, so you can take that for what it's worth.","436":"Zen Micro[+2][s] Overall, I'm very pleased with the Zen Micro and based on my experience with it (as well as it's older sibling Creative Nomad IIC), can recommend it without reservation.","437":"I say get one today!!","438":"It had issues right off the bat, with freezing up, staying in 'SHUTTING DOWN' mode, and just not functioning very well in general.","439":"The touch-pad would be a great thing if it worked well, and as I never had issues getting songs transferred to the player, I did have problems accessing them from the player.","440":"Many other reviewers are mentioning that they have had no problems at all> I would say that the main problem is that this player is just not made very well.","441":"It is the 'first generation' of the player, and while I still agree that it is a great alternative to the iPod, I think there are many others that would be a much better value for your buck.","442":"If someone asked me flat out, i'd say to go woth something else.","443":"After heavy duty research and reading reviews, I decided to plunge into the MP3 player circus and got myself the Zen Micro.","444":"Why not join the iPodders like the rest of the world?","445":"I have my reasons.","446":"I've played around with a friend's iPod a couple times and it IS a cool unit.","447":"Perhaps I bought the Micro to be different, the cheaper price tag (from Amazon), the design, or avoiding the high iPod theft in NYC subways.","448":"Whichever it may be, I'm happy I've made this purchase.","449":"I waited a week to make the Micro worthy of a review.","450":"When I opened the box, I was shocked by the size of this thing... It's TINY!","451":"It's shorter, sleeker, more compact and fits comfortably in my small hand than the iPod...My Nokia cell phone towers over this bad boy!","452":"The interface has a sassier flair and the blue-lit trimming is an added bonus.","453":"The iPods, like most Mac products, have a sophisticated but bland, look to them... Preferrably, I like some sass.","454":":) I was also happy that my shipment came with all the accessories (minus extra battery).","455":"In stores, the Micro doesn't even come with the AC adapter.","456":"Moving on to sound department... It delivers!","457":"I expected this coming from Creative.","458":"The earbuds, on the other hand, are decent in sound, but lacking in bass.","459":"I've since replaced it with a pair of black Sennheisers... Not only are the packaged earbuds pretty uncomfortable, but are too similar to iPod's and can target iPod theives here in NYC.","460":"Functionality, menus are easy to navigate... As many have mentioned, the touch pads take some time to get used to, but I've gotten used to it.","461":"I actually prefer the vertical strip rather than running my thumb in continuous circular motion.","462":"Although, I thought it could've been designed a bit better.","463":"There are extra features packed inside this unit (some that most will hardly ever use) such as FM radio tuner, voice recorder, calendar, and alarm clock.","464":"I'm guessing the more features you enable, the more the battery will drain.","465":"Speaking of battery, it's removable AND replaceable!","466":"The life-span on it, though, is NOT as advertised, but if you're not a heavy user, you can tick in at 9-10 hours of playback.","467":"And if you read the description on Creative's site, it does mention that the \"actual battery life will vary with use.\"","468":"Overall, the Micro is a solid device and I haven't fell into a problem with it yet *knocks on wood*.","469":"It's perfect for those who aren't planning on storing tons of music.","470":"Transferring music is a breeze. I don't subscribe to music services, but as mentioned on other reviews, Micro allows you to subscribe to services OTHER than iTunes.","471":"It may not top the iPod Mini, but it's definitely an alternative if you also want the extra features and good sound quality.","472":"Strong Points: - Design: small, comfortable, curved, and stylish.","473":" - Colors: 10 variety of HOT colors made it difficult to choose from.","474":"You don't need to cough up an extra couple bucks for a \"special edition\" to get black! - Sound: Awesome! - Batteries: removable\/replaceable.","475":"- Audio Formats: supports both MP3, WMA... And yeah, WAV too.","476":" Weak Points: - Touch Pad: design could be better - Volume Control: controlled through the vertical strip, but purchasing a headphone with built-in volume control will do the trick.","477":"- Radio Quality: weak reception","478":"It's nice that the Zen Micro has bells and whistles like FM (but where's AM???) and voice recording, and 20% more storage than \"the other\" mini MP3 player, but why is it so (...)ugly?","479":"The colors are a joke, and I personally hate the stupid vertical touchpad.","480":"But my biggest gripe is still the extremely ugly design.","481":"What's the point of having \"good audio\" in your hand when your g\/f thinks you have no taste whatsoever and your friends laugh their heads off while proudly showing off their iPod Mini?","482":"Creative should hire some real industrial designers.","483":"Still has terrible software.","484":"You have to wonder why Creative can't get this right.","485":"Looks nice but the conrols are awkward and the entire front is touch sensitive.","486":"You do get 1 more GB than an iPod mini.","487":"Screen review could be better.","488":"Apple stil does it better but needs to come out with a 5 gig mini.","489":"This product is amazing and better than the Ipod you can get at the same price.","490":"the 4G Ipod costs the same as this 5G Zen Micro.","491":"It also has a voice recorder and FM radio that you can only get on an Ipod if you but an adapter seperately.","492":"Creative did an awesome job with the design.","493":"The headphones have great sound and durability and mine came with some extras when I bought it (a stand, a belt hook, charger) that I know doesn't come with every one.","494":"I have the black one and adore it.","495":"It looks nice and sleek and the blue background light looks awesome against the black.","496":"The touch buttons do take a little getting used to and I don't like how the scroll button is the same button used as an \"enter\" key, but you get used to it and it isn't a big deal.","497":"I take mine everywhere.","498":"I bought my Zen Micro three months ago mainly because I preferred the size and style to the iPod mini.","499":"Overall, I've been very impressed with the player.","500":"I've had almost no problems with the firmware (ie, lock-ups, shut-downs etc), but I have kept the player up to date.","501":"Also, the latest version of the firmware seems to actual deliver (in fact, more than deliver) the 12 hour battery life the specifications claim.","502":"Originally I was only getting around 8 hours of playtime out of my Zen Micro, but now I consistently get 10-13.","503":"I'm not sure whether this is related to the charge cycle of its Li-Ion battery, the better firmware, or a combination of both factors.","504":"I imagine if I left my player untouched (no backlight) it could play for considerably more than 12 hours at a low volume level.","505":"One of my favorite features about the player is its ability to sync to Windows Media Player.","506":"With the latest version (10), I can simply browse my WMP library, adding songs\/albums\/artists to the sync list, and then sync all of the tracks at any time.","507":"Its just as fast as the included Creative software, but much less invasive, and overall better looking.","508":"With WMP10, you don't need to install any software other than the driver, which makes using multiple computers fairly simple.","509":"The touchpad is great once you get used to it, and I much prefer it to standard buttons or scroll wheels (as on the Dell DJ for example).","510":"They are sensitive and accurate (perhaps too accurate, it senses through t-shirt cloth, but the touchpad can be locked), but easy to clean, unlike buttons.","511":"Also, the touchpad seems to be waterproof to some degree.","512":"The FM radio's reception isn't spectacular, but it will pick up the most powerful stations in any given metro area.","513":"Its ability to record radio is useful as well, but would have been moreso if it could be preset.","514":"The player looks great, feels great, and sounds great.","515":"So far it has been very durable (other than the little pads on the earbuds), but those aren't really necessary as I find them comfortable on their own.","516":"They also sound excellent compared to other earbuds including retail sets like Panasonics and Sennheisers.","517":"I've dropped the device several times onto hard surfaces, and it still works flawlessly.","518":"Every few years I crawl out into the electronic world, in search of a new MP3 player to replace the horribly inadequate one I currently own.","519":"This year, it seems that I choose my timing perfectly, having discovered the awesome device that is the Zen Micro.","520":"Of all the players that I have owned in the past (6 of them), all of them have had drawbacks and problems.","521":"Although some came close to perfection, none of them left me completely happy with their performance.","522":"To me, the key elements that must be present in an MP3 player are as follows:  -Fast transference of songs to player -Well-designed computer-side interface -Easy menu navigation and well-designed control scheme -Good sound (duh) -Reasonable battery time (~6 Hours)  That's it?","523":"You ask, yup.","524":"That's it.","525":"I know this list is horribly unreasonable, which is why it amazes me how many players lack some of these basic features.","526":"Slow file transfers, menus that take ages to cycle through, and poor battery life plague many of the!","527":"players that are currently available, but not the Zen Micro.","528":"My list of \"nice to have\" features is a little longer, but it also contains nothing unreasonable: backlit screen, removable battery, FM Radio feature, ID3 Tag line support, lots of storage.","529":"Everything that I have listed above, the Zen has, and more.","530":"The menus are easy to scroll through; they are laid out naturally, and make sense.","531":"The computer interface is 90% good, only losing points due to the fact that \"Creative\" branding is all over the place within it.","532":"Songs transfer lightning fast, and the two batteries that came in my box give me 24 hours of listen time.","533":"On the fly play list creation, address book, removable storage drive capabilities, sound recorder, the list goes on people, this thing is literally so chalked full of goodies, it was like Halloween all over again.","534":"So far I have used all of the above-mentioned features, and find them well designed, and easy to understand.","535":"Not everything in this world is 1!","536":"00% good though, and the Zen does have a few drawbacks.","537":"While transferring songs to the player, the interface has crashed a few times (4-5 times in a 4-5 hour period) normally this would cause me major concern, but it appears that this bug is reproducible, which leads me to believe that Creative will fix it with a patched version shortly (or maybe it's just my computer).","538":"Another thing I don't like is that some of the features take 1-2 seconds to load up.","539":"These are limited to the voice recorder, address book, and such.","540":"I will be using the player 99% of the time as an MP3 device, so these small pauses are entirely bearable, for the added features just to be available.","541":"Really that's all I can find wrong with it, it took some major bouncing around to get a song to skip (there is a hard drive within), and I don't forsee jogging (wich I plan to do with it tonight) to cause any problems whatsoever (if it does, I'll update this).","542":"That's it for now, what are you doing still reading this, click the \"Add to Cart\" button already!","543":"UPDATE March 3rd, 2005: I bought my Dark Blue Zen Micro back in November, when they first came out.","544":"Right out of the box, I loved it, better features than the Ipod, great sound quality and no limitations on what music sources I can use.","545":"I loaded my whole CD collection on it and took it everywhere, even at work.","546":"So, I was one who was ready to give it 5 stars with no complaints at all.","547":"Then last week, my player just quit working, period.","548":"After consulting with Creative's customer support, they determined that the hard drive was broken and the only recourse was to send it in for repair, which would cost me $40, since it's past the 90 day warranty (pretty short warranty).","549":"They said the repair could take weeks, and being impatient, I decided to just order another one, 1 day delivered from Amazon, and then I could have two, one for at work and one for at home.","550":"Well, I got my second player, and right out of the box it wasn't working right and once again, after consulting customer se!","551":"rvice, they said I should send it in for repairs.","552":"I loved the Zen Micro, and thus it pains me to say this, but I have a hard time recommending something, when I've had two of them break on me in such a short time of owning them.","553":"They obviously have quality and reliability problems.","554":"They have a good concept here, and I normally expect a lot better quality from Creative, so maybe they will do better with the next gen version, but for now I say buyer beware.","555":"ORIGINAL REVIEW December 2004 I'm sorry to read about other people having problems with their Zen Micro, but mine has worked great!","556":"This is my first MP3 player and I am so impressed with what such a small device can do.","557":"I have ripped over 100 songs from my CD collection and it was so easy and fast, and they all sound great.","558":"I didn't experience any problems with the software or getting my computer to recognize the player.","559":"My PC is running Windows 98 though....maybe having old outdated things is a good thing for once!","560":"Y!","561":"es, the interface took a little getting used to, but once I did, it's almost second nature now.","562":"I love that you can create custom playlists, and organize music in so many different ways.","563":"Only slight negatives I've had so far is that I haven't been able to get it to accept any of my WAV files yet.","564":"It's supposed to support that format, but I keep getting a file transfer failure no matter what I try.","565":"My other nit is that it didn't include at least some kind of carrying case for everything.","566":"Yes, there is a belt clip, but that doesn't hold the extra battery and usb cable.","567":"The little bag it comes with is cheap and useless.","568":"It barely holds anything and mine just puts a bunch of thread fuzzies all over the player, because the bag is cheap and seems to be coming apart.","569":"I threw it away.","570":"Those are minor complaints though.","571":"I love my dark blue zen micro and would definitely recommend it.","572":"Soon I will have every CD song I care about from my collection to carry around with me.","573":"Amazing.","574":"I'm a new to mp3 players.","575":"For years I've downloaded songs and burned CDs, but I decided to simplify my life and get an mp3 player.","576":"After reading reviews and talking to a few friends, I decided on the Zen.","577":"It is not a perfect product but it does have a lot going for it.","578":"The FM tuner, the 5G of storage, and the removable disk are all great features.","579":"The removable disk isn't really explained in the product literature but basically it allows you to partition a portion of the drive for data.","580":"You can then hook up the Zen via USB to any Win2K or later computer and use that partition to store data files.","581":"Any audio files in this area can't be played by the player.","582":"I primarily got the Zen to use for band practice, so I use the removable disk to store lyrics and sheet music.","583":"The fit and finish of the product is first-rate.","584":"The slow throbbing glow that it emits during charging is cool too.","585":"On the downside, I think the interface takes some getting used to and the Zen software !","586":"is not as intuitive as I would like.","587":"Also, the earbuds that came with it sound great but are uncomfortable (although my wife didn't have a problem), so I bought a pair of over-the-ear headphones.","588":"I haven't used the Organizer feature (apparantly you can sync with Outlook).","589":"You can also record with the built in mic and record FM broadcasts, I haven't tried those either.","590":"Overall, I am very pleased with it.","591":"The more I use it and figure out how to do things, the more I like it.","592":"I would give the Creative Zen Micro five stars without hesitation...except for the eight hours of my life I can never get back.","593":"Doing what, you ask?","594":"Why, troubleshooting, mediating software conflicts, devising workarounds, and when things got too bizarre, even calling tech support.","595":"Now, there's nothing wrong with the Zen Micro a few months in beta testing wouldn't iron out.","596":"But, they rushed it to market, so you, general public, get to roll the dice.","597":"Are you feeling lucky today?","598":"Who knows -- you may avoid a migraine altogether.","599":"Before you run out and buy an iPod, understand something: there are REASONS the Zen is worth encountering this kind of hassle, principally excellent (for MP3) sound quality.","600":"The supplied headphones are hands-down better than the mediocre iPod buds.","601":"That said, you can get more of what the Zen is capable of by donating them to your local iPod person (they're white) and getting a pair of $60-$80 aftermarket headphones.","602":"I'm getting stunningly good resul!","603":"ts with Sennheiser HD-497 phones.","604":"Going further up-market and using super hi-rez audiophile headphones is probably overkill; they will only serve to cast MP3 limitations into sharper relief, and honey, you can't hear what ain't there.","605":"An aside about sound quality: You can have good sound or 2,000+ songs, not both.","606":"You're better off not dropping below 128 kbps, especially with music.","607":"64 kbps is a terrible price to pay.","608":"If you absolutely, positively need over 2,000 songs for your next wolverine photo shoot, get a 10 GB player.","609":"The player is smaller than you think.","610":"Something about the pictures suggests a deck-of-cards size, but you can hide the Micro completely under a standard business card.","611":"The touch pad is over-sensitive, and is adjustable to only slightly oversensitive.","612":"You quickly learn to brush your thumb ever so lightly over its surface.","613":"To minimize any frustration (and the odds that you may return a usable unit), keep the following in mind:  1. While your unit is!","614":"unboxed and charging up, visit the Creative website for necessary firmware and\/or driver upgrades, especially if you're planning to use a service like Napster.","615":"Keep in mind the required upgrade may be a beta version (mine was).","616":"2.","617":"Some upgrades are needed for the Micro to work properly with the Windows XP operating system and Media Player 10.","618":"3.","619":"You may need to briefly disable various spam blockers, cookie swatters, and antivirus programs (I know, I know -- get offline first).","620":"My gatekeeper programs kept fixes away a few times until I got wise to it.","621":"Bottom line: If you value excellent sound quality and the ability to use music subscription services, and are willing to deal with the possibility (not the certainty) of setup gremlins, by all means get the Zen Micro.","622":"I bought this item in part due to the good reviews here on Amazon.","623":"The machine itself seems fine, but the software that came with it is AWFUL.","624":"After installation, the very first time I booted up the Creative MediaSource Organizer, intending to use its CD burning and ripping functions, it totally shorted out.","625":"I tried everything to make it work - followed advice from Microsoft support, uninstalled and reinstalled the whole thing, rebooted every five minutes, ran a virus scan on my computer, checked my drives for errors, everything.","626":"I was up all night trying to make the stupid thing work, to no avail.","627":"Of course one of the first things I did was write an email to the customer support at Creative, through their website, and by the time they finally got back to me - several working days later when they promise only one - their suggestions were completely worthless.","628":"Now I have to wait another few days for them to get back to me again, probably with more worthless suggestions?","629":"And t!","630":"his is what I get for my $200 on this MP3 player?","631":"I think I'll stick to CDs.","632":"The Zen Micro is near perfect.","633":"I bought my Zen Micro last december as a christmas gift to myself, save for a few software issues, I couldn't be happier with my purhcase.","634":"I've owned this player for nine months now and it's been on 5 cross country trips, one trans-atlantic honeymoon, and numerous roadtrips.","635":"It's been in my pocket, in my car, and in my bag in 20 inches of snow and 100 degree summers.","636":"3It's been dropped, shuffled, kicked, and Lumbered.","637":"It's still alive, still kicking, and still playing.","638":"I've never owned an Ipod, so this won't be a which one is better review.","639":"All of my files are mp3 or wma, Windows Media Player is my primary music suite, i use it to burn, play, rip, and sync.","640":"So starting out i knew i wanted a windows friendly player.","641":"The Zen Micro (mine's black) has a lot going for it.","642":"It fits into a hand well, it has a removable battery (this is important), great sound quality, fm stereo, recorder, smooth UI, and a feature that most unipods lack... char!","643":"m.","644":"When it's being used or charged it emits a low pulsating blue light.","645":"It's doesn't have a scroll wheel, but it has a strip!","646":"Most people complain about the sensitivity, but it can easily be adjusted for personal preference.","647":"My ONLY complaint is that when i first received it, it was a little buggy.","648":"It wouldn't always work seemlessly with WMP and it often required me to restart the frozen micro by taking out the battery and restarting it.","649":"over and over again.","650":"But after a few firmware releases it's working without a hitch.","651":"I've programed WMP to throw a few favorites on there all the time and always put my new music (less than 3 months) on so I can listen to them in the gym.","652":"The accesories that come with the player are great.","653":"White earbuds ( i replaced those with some shure headphones, big difference), a case, a stand, a clip (which doesn't really work), and a nice little zen micro bag.","654":"Also all the required cables and what not.","655":"To me, currently at $218, this player is a!","656":"best in class.","657":"It gives you the most bang for your buck, period.","658":"Creative has been making computer sound equipment for decades and with the zen micro it finally has something with enough quality and, yes, charm to win a nice size of the digital player pie.","659":"Pick your favorite color and buy it.","660":"Alot of people seem to compare any music player to an Ipod.","661":"Comments such as \"it's stylish\" or \"it looks cool\" or \"everyone has it\" don't nesseseraly make something good.","662":"About the Ipod: it has it's downfalls as well.","663":"As for the Zen Micro:\\  Cons:  I read that every button is touch sensitive, and thats very annoying when all the main buttons are on the front.","664":"Putting the Micro into your pocket could trigger just about anything (unless the hold feature is improved: it asks if you want to \"unhold\" for every button up press) Second, I'm worried about the durability of the player.","665":"After research of other creative hard drive players, i found that most of them aren't very durable and tend to crash (read most reviews on amazon.com and see for yourself).","666":"Last, i find the price a bit expensive for a product such as this.","667":"$190 or $200 or less would have been much more reasonable (price compareble to 20gb mp3 players).","668":"As for the warrenty, i havent seen it yet, but i fear for a short on!","669":"e again.","670":"Pros The Design is very nice, and the colors are too.","671":"They are bold colors, not the (personally) irratating toned down 'light' Ipod colors.","672":"It also has tons more features then previous creative products, and most of them are very useful such as the ability to custimize the main menu to show the stuff you want, not the default items (creativelabs.com for more on that).","673":"The battery is also convenient, but could have been better, such as the Zen Touch's battery (but at least this one is removable).","674":"Verdict:  Had I not needed something with a tad bit more space, I consider this player fair game.","675":"If you don't mind all the buttons being touch sensitive, I'd recomment buying it to try out, and also buy an extra 2 year warrenty for it (there are some offered here, for about $15 dollors I think).","676":"Closing: For everyone who is shallow and buys the Ipod only becouse of it's looks (i'm not saying it's necissarily bad), here's a joke: What did the Pencil Sharpener say to t!","677":"he Pencil?","678":"Stopping going in circles and get to the point.","679":"Why go in circles to find something you want? (  :)  )","680":"so i admit it... i wanted a zen micro, because the appeal of the iPod was overshadowed by it's annoying trendy hipster popularity and i felt better about myself for choosing a rip off version of that trendy hipster popularity.","681":"anyway, my wife got this for me for my birthday and I love the thing.","682":"I mainly only get to listen to music in my car, so it's an awesome replacement for a console full of the same ten cd's that have been in there for the last 8 months that i keep forgetting to replace.","683":"she also got me an iRiver FM modulator that plugs into the ligher outlet, so i can play it through my regular radio.","684":"anyway, here's the pros and cons:  +linux compatible with the 1.x series of firmware.","685":"the program is called Gnomad and works great for me and seems to cover all the features the included windows sofware does.","686":"+looks snazzy +smaller than a pack of smokes - easily transported +ac charger included as well as a hardshell that comes with a clip and a stand adapter +USB cable !","687":"included - charges via USB, so whenever you plug it into your computer, it's charging up.","688":"+Battery life is awesome IF you upgrade the firmware [requires a windows pc] OR make sure to always plug the ac adapter into the player before plugging into the outlet +Awesome sound quality... I mean it is Creative right?","689":"Aren't they something of digital sound experts?","690":"+Sorts music by artist, album, genre, etc... it's easy to wade through 5 gigs of tunes to find what you're looking for.","691":"Also provides for playlists which are nice, but really only usefully set up through the PC software.","692":"before i get into the cons, i'll make a note about the scrollpad.","693":"It DOES take some getting used to.","694":"my initial reaction was to tap the up and down arrows, when in reality, you need to touch, maintain contact and slide your finger up and down.","695":"it's a little counter intuitive at first, but works great when your used to it.","696":"it's a neutral feature in my book.","697":"simple mechanical buttons would probably work !","698":"just as well and would be less confusing for new owners, but i guess they wanted to rival the iPod's search wheel.","699":"whatever...  on to the negatives:  -touchy about charging... you can damage the battery and seriously decrease it's life if you don't upgrade the firmware OR dont' heed the advice to always plug in the player side of the cord before plugging in the outlet side.","700":"-doesn't like to be charged via USB on non windows PCs or PCs that don't have the Zen Micro driver installed.","701":"It has the odd side effect of the buttons only partially working?","702":"Simply removing the battery and then replacing it fixes the issue, but it's annoying.","703":"The new firmware fixes this as long as you put the player in lock mode before plugging it into said PC.","704":"-User's guide doesn't cover a lot of important info that is covered on their website.","705":"I definately recommend upgrading the firmware, which is as simple as downloading a program from creatives website and running it with your player plugged in.","706":"(linux geeks -> avoid the 2.x series that is aimed at windows media play!","707":"er compatibility, you can't downgrade the firmware.","708":") -Can't be left in the car... it immediately shuts down with an overheating error if left in a hot car for too long.","709":"But since it's so small, it isn't a big deal to bring it with me.","710":"Overall though, i'm very happy with it and highly recommend it to folks looking for a mp3 player, even if it is to pretend your not a braindead consumer giving into the marketing hype of the iPod. ;)","711":"I have been researching MP3 players for the last two weeks.","712":"Of course the first one I decided to research first was the Apple iPod.","713":"However, as soon as I found out that I could only download songs from iTunes, I immediately decided that was NOT the MP3 player for me.","714":"In addition, I didn't like the fact that I'd have to pay $.99 for each song I wanted to download.","715":"So I went to www.playforsure.com to see what devices were compatible with various downloading services.","716":"I had been eyeing the Creative Zen Micro 5GB as I researched various players.","717":"I finally decided to purchase this player because it was compatible with Napster 2 Go....which is a subscription service, allowing me to download as much music as I want for a $14.95 flat fee.","718":"I have a lot of songs that I need to download.","719":"I was going to purchase a pink one and then decided that I'd get a purple one because that's my favorite color....however Circuit City had it for $10 cheaper ($219.00) in black and I could !","720":"pick it up from the store.","721":"So I decided on the black one.","722":"And I must say...this MP3 is very cool.","723":"It is exactly the same size as my flip phone.","724":"It's so cute...and behind the black panel it glows in a neon blue.","725":"After installation, which was VERY simple....I downloaded any updated software from the Creative website, before I downloaded any music.","726":"There were two downloads I had to complete.","727":"One was the firmware upgrading from the installation CD and the second was regarding the \"playforsure\" (even though it's in BETA), to make sure I could use Napster 2 Go.","728":"I then registered with Napster 2 Go and it immediately recognized my player.","729":"And within one hour I had downloaded , organized my play lists and was listening to the songs I downloaded.","730":"Napster 2 Go also allows members to view other members play lists in different genres, so if you are looking for lots of songs and you don't want to search for them endless, you can just grab them from other members play lists. !","731":"The sound is very nice.","732":"I feel like it's just me and the music and I am transported into a different world.","733":"It also comes with a case so you can either stand it up or use a belt clip.","734":"So I can't wait to get on my treadmill with it.","735":"I also like the lock feature, so it makes the touch pad inactive.","736":"I tried to use the FM radio option, but it doesn't seem to really pick up the stations I listen, however I am going to try it in a different location, it may have just been my residential location.","737":"I would say the only thing I need to adjust is the sensitivity of the touch pad.","738":"Even when I set it to low, it's still very hard for me to adjust the player to where and what I want it to do.","739":"However, I am going to try the suggestion of changing the sensitivity to high and see if that solves the problem.","740":"Otherwise, I am extremely please with the Creative Zen Micro 5GB MP3 player.","741":"PS.","742":"I've been ZETAZEN long before this player came into existence...lol and my player's name is ZETAZEN.","743":":-)  www.zetazen.com","744":"I had to revise my review today!... If you are still trying to decide Ipod or Zen Micro, Yahoo! has just closed the deal.","745":"They now offer Yahoo Music Engine, wich is like Napster to Go, but at a fraction fo the price.","746":"Its $4.99 a month ($60 annually) to download as much music as you like.","747":"You can fill it up with anything you like out of there 1 Million song library.","748":"Also if you want to purchase music, its just .79cents per track ..... Here is my origianl review....\" My wife already had the Ipod Mini when I purchased this, and I must say seeing it in action, I had some reservations about getting a Zen.","749":"However after playing with it for three weeks now, I'm convinced, the Zen Micro is superior.","750":"I think sound quality should be the first and foremost feature, and the Zen is leaps and bounds better in sound quality, with no need to upgrade the earphones.","751":"I thought the FM radio would not see much use with so many tracks avaiable to me, but its great for tuning in to TV programs at the gym while on the treadmill, concerts and programs being simulcast, NPR, and on and on.","752":"When you don't feel like toting a PDA while out for the day (i.e. cycling, window shopping, etc,)simply download everything thru outlook.","753":"I've read about the issues with the scroll bar, but they must have taken care of that now.","754":"Mine is as easy to use as the mini without any firmware download.","755":"Its also smaller, and gets more looks.","756":"People are use to seeing so may Ipods, that when they see my Zen, they have to ask questions.","757":"An extra gig of room, FM radio, voice recorder, PIM applications with sync to Outlook.","758":"This is really a no brainer.","759":"BUY THE ZEN!\"","760":"I purchased this over the Ipod Mini because it had several nice features: extra 1G storage, WMA support, replaceable battery, and especially that it wasn't an Apple product with their proprietary architecture.","761":"After using it for a week, I wish I had purchased the Ipod.","762":"The Touchpad is virtually unusable -- sometimes you have to press like mad to make a selection and other times the slightest brush causes something to be selected that you don't want.","763":"This is by far my biggest complaint.","764":"Another problem is that the latest 2.0 firmware upgrade moves you into Windows Media Player 10 which seems to be very, very slow for downloads.","765":"Also note that it doesn't seem to charge when connected to the PC, only when plugged into an AC socket even though they both connect to the single USB port on the player, so you have to charge the battery separately from downloading music.","766":"... then this might intrigue you greatly.","767":"The hook with this MP3 player, distinguishing it from the others, is clearly going to be the OS applications it provides.","768":"Finally, someone has figured out that building some smarts into the player will help it compete with iPods.","769":"The latest craze for MP3 manufacturers is the 5Gb microdrive, a 25% boost from the 4Gb ones supplied by Hitachi.","770":"At this point, the Rio Carbon is 5Gb (along with a host of South Korean manufacturers), and eventually the iPod will get a \"free\" upgrade to 5Gb as the 4Gb trickle down to nothing.","771":"Then what?","772":"What compels you to choose one over the other?","773":"It has to be the UI and user experience.","774":"The Carbon is nice but offers no improvement to the near-perfect iPod experience.","775":"The scroll wheel is not an Apple innovation, but it took Apple to put it on their MP3 player for the obvious to become clear to the industry.","776":"So tack on a scroll wheel and... you still have to compete against the intuitive OS-based application that an iPod offers the user.","777":"It's easy to find songs, organize songs, and also carry some essentials and diversions.","778":"The iPod gets it right, the Carbon doesn't.","779":"Today, the Creative Zen Micro proves it, too, gets it right.","780":"Better for the Zen Micro is Outlook compatibility.","781":"This makes the Zen Micro the first choice for MP3 owners with a Windows-based system.","782":"I'm not professing to be a consumer-survey corporation, but I don't know *anyone* with an iTunes account.","783":"However, I do know about a dozen people with well over 4000 MP3s each.","784":"What device would I recommend?","785":"Well, if size matters, and you like the idea of a lime-green or bright yellow device, then I'd have to go with a Creative Zen Micro.","786":"Creative has excellent music software, a very responsive tech support group (they are quick on firmware updates, and make them publicly available), and usually a good array of accessories.","787":"The Zen Micro is no exception: in addition to the case, it comes with a neck strap, and has all of the necessary cables for syncing and charging.","788":"The extra spare battery is just a neat bonus.","789":"If I could, I'd trade-up on my Creative Muvo2 and snag a Zen Micro tomorrow.","790":"**** I gave up a ton of positive reviews to add this addendum.","791":"I do not work for Creative; I had a chance to play with a review copy in-depth, as others have (See Engadget, Gizmodo, or c|net as examples).","792":"Just because Amazon doesn't have it to sell doesn't mean the product is unavailable for review.","793":"Please judge any review you read -- in any medium, be it here or newspapers or magazines -- by its own merits. ****  Fred","794":"I already own the Creative Nomad Zen, the 30 gig version.","795":"I wanted something more portable, shirt-pocket sized, and something to complement the new Yahoo Music Unlimited site.","796":"This is a perfect blend to accomplish both tasks.","797":"My big Zen has hundreds of CDs on it, but this little player will store my most listened to tunes, or songs Iwant to download for free from the Yahoo site, \"test drive\", then decide if I want to download permanently into my larger Creative.","798":"I also own a retail store and this little guy easily plugs into my AUX slot in the store's sound system.","799":"Feature for feature, I find it a very sweet little player; equipped with a higher end headphone system, between this and th larger Zen Ihardly use my home stereo system anymore.","800":"And I gave my CD plyaers away in a garage sale.","801":"If you buying this player to use with Napster to Go, wait a while.","802":"A lot of people are having problems with the firmware update required to use the player for Napster to Go.. The firmware is beta and they are are a lot of bugs in it.","803":"Check out message boards on Napster for more info.","804":"if not amazed, I won't go into the kind of detail many people have here, but I do want to say a few things about my experience so far (I've had it about two weeks) with the Zen Micro;","805":"these are the things I was curious about when I was shopping around.","806":"On the whole, I'm quite happy with the purchase.","807":"The sound is bright and clear, the ability to store any MP3's (and not just Apple-approved files) is great, and I plan to make use of the storage space and sound recording from time to time.","808":"The device looks very cool, I think (exactly as the photos promise), it's comfortable and lightweight in my jacket pocket, and the interface and controls are easy enough to navigate after a bit of practice.","809":"No offense to Amazon, but I was able to find one online for just over 200 bucks (I'm sure prices here will continue to sink), and that also seemed quite a good bargain for the amount of storage space.","810":"Now the downside:  One of the features that factored into my choice of a Micro!","811":"instead of an iPod (I know this is a tediously recurring theme in these reviews, but I want to get my two cents in) was the FM radio.","812":"I like some local stations, Stern, and NPR, and so the radio seemed like a great option.","813":"Imagine my disappointment, though, when the Zen Micro proved able to play only the mega-strongest FM signals in my area.","814":"It seems like you need to park yourself right next to a radio tower for the Micro to pull in a strong sound.","815":"The battery, as others have said, also seems weaker than Creative suggests.","816":"Here's a quote from Creative's web site (hoping to sell additional batteries):   \"Carry an extra rechargeable battery for your Zen Micro for an additional 12 hours of nonstop music.\"","817":"Try an additional *six* hours, methinks.","818":"Still, that's enough time that I'm still satisfied, if a bit grouchy with Creative's overhyped promises.","819":"Have not had any issues with the headphones or fragility.","820":" As I said, I don't regret the purchase at all.","821":"To use a bas!","822":"eball metaphor: I was hoping Creative hit a home run here, and I think the Zen Micro is more like a stand-up double.","823":"Respectable, solid, but not awe-inspiring.","824":"If you're considering an iPod mini or even an iPod, read this.","825":"I looked at the market extensively and took a lot of advice before making the big buy here.","826":"I wanted a player that had good capacity, construction that can stand up to exercise, good sound quality, good battery life, good looks, compatibility, and a fair price.","827":"Tall order, eh?","828":"Actually, the Creative Zen Micro solves all that.","829":"Sound quality? Phenomenal.","830":"unarguably better than Apple's, and nice earbuds to boot.","831":"Looks?","832":"Let's just say it's no coincidence I put \"Foxy Lady\" on there.","833":"Your choice of ten colors in a beatiful package.","834":"Capacity?","835":"Apple has tried to hide something from you: most people don't actually need more than a few gigs at most.","836":"Five gigabytes is plenty for my great albums.","837":"(Like I really wanted \"Hotel California\" anyway.","838":")  Construction?","839":"Tough as nails.","840":"No skips, and it hasn't faltered once (despite your inevitable drop or two.","841":")  Compatibility?","842":"Flawless.","843":"They've partnered with Napster to give you a! free month of the subscription service (read: all the music you want free for thirty days, when you can cancel with all your music safely hidden away.","844":") No locked-in proprietary business like Apple; this baby plays WMAs too.","845":"The voice recorder is a beautiful add-on; not even necessary, but just an example of why Apple just wants your money and Creative Labs wants to make a better player.","846":"Gets nice sound too.","847":"The FM tuner is just a little spare icing on the cake.","848":"And the price?","849":"A bargain $200.","850":"Do NOT buy Apple.","851":"Inferior quality at a higher price (and shoddy reliability) is not quite justified just because they have a better spokesperson.","852":"In conclusion, this player is beautiful.","853":"Power for the tech-savvy, ease of use for the less fortunate.","854":"But it; you won't regret it.","855":"I must say, after tons of research, I have chosen the right Mp3 player.","856":"This player is absolutely phenomenal, I haven't had any problems, and if you're worried you will have problems, I suggest buying it at a retail store that has a good return policy but anyways... I find the touch pad very easy to use, and I'm surprised so many people have had problems.","857":"The sound quality is superb, much better than that of an iPod, in my opinion.","858":"The radio works excellent in my area, I'm not sure everywhere else.","859":"The software is very easy to use, and the transfer is super fast!","860":"I'm not gonna go into the features cause if you're reading this review, you've probably already looked at them, but I must say the DJ feature if Very cool and the removable battery is also a bonus!","861":"Mine came with a wall adapter, but it charges when plugged into the computer anyways.","862":"The blue light also makes this player one of the most fashionable in the market also.","863":"Overall I have no complaints, this is jus!","864":"t simply the best player on the market for a really low price, so why look anywhere else?","865":"I've been using iTunes for about a year now with the intention of eventually buying an iPod.","866":"That was before the Zen Micro came along.","867":"I've had it for about a week now and have to say it's one of the best purchases I've ever made.","868":"it's a great looking, easy-to-use device but it's the sound quality which is truly amazing -- far better than my Sony mini-disc player.","869":"I have no problems with the touch pad (once the sensitivity is set to low) and the interface is a breeze to use without even looking at the PDF manual.","870":"I can't comment on the bundled software as I haven't even looked at it.","871":"Why bother when it works perfectly with Media Player 10?","872":"As for the problem with locking up mentioned in a previous post, it only seems to happen if the USB cable is unplugged while WMP 10 is still running.","873":"I just close the program down first, wait for the message to appear on the Micro, then unplug it.","874":"This appears to prevent the lockup issue.","875":"The battery life doesn't appear to be any!","876":"where close to 12 hours but at least it is replaceable (and they included a second one free).","877":"I would give it about 6 or 7 hours, although it will probably get better after a few charge cycles.","878":"This was probably the biggest reason I chose the Micro over an iPod.","879":"The extra Gb is just a bonus.","880":"The headphones which came with it are mediocre at best but what can you expect from a set of \"ear buds\".","881":"Plug in a decent set or hook it up to a stereo system and prepare to be impressed.","882":"If your looking for a great sounding mini player, you can't go wrong with the Zen Micro.","883":"After much research I decided that the Zen Micro was the best mp3 player for me.","884":"Unfortunately I was wrong.","885":"Within one month, my player completely died.","886":"(It had locked up multiple times previously, but always managed to work afterwards) This time, the touch screen wouldn't respond to me and none of the buttons worked.","887":"So I took out the battery and put it back in again, only to find that it would not work.","888":"Frustrated, I exchanged the player only to get another faulty one!","889":"I had the second one for less than two weeks when I noticed a rattling\/humming\/buzzing sound while music was played.","890":"I've tried different headphones, upgrading firmware, using different files and nothing helps.","891":"I sent Creative customer service 3 emails in which they did not help me one bit and don't seem to even want to help.","892":"I've heard many good reviews of this product and I wonder if maybe I just had bad luck.","893":"It was a good player when it worked and I loved the design.","894":"It's too bad, though, that !","895":"I don't want to keep testing my luck.","896":"This time I'm going to get something a little more reliable - an iPod mini.","897":"The Creative Zen Micro, at first glance, is a dream come true for all mp3 and music lovers.","898":"I absolutely didn't want to by an Ipod.","899":"Not because I wanted to go against the grain, but the idea of having to shell out another 100 bucks (after a year) in order to have Apple replace the non-removable battery just turned me off.","900":"The Zen offered a great alternative.","901":"Now, there are many alternatives to the Ipod, but I wanted a nice design, also, and not some generic looking mp3 player.","902":"I wanted something that looked at least almost as good as an Ipod.","903":"I saw the Zen, and-BOOM-I bought one for me and one for a family member.","904":"What happens follows:       Let's start with the software.","905":"It's easy to use, and makes transfering your CD collection to the player a cinch.","906":"You can compress the files for more storage space before you start the transfer.","907":"The sonic detail at the highest compression rate(64 kbps WMA) is crazy.","908":"The clarity is unbelievable, which means you can cram almost the full 2,5!","909":"00 song capacity of the disk without having to worry about the quality of your music (the Zen micro, actually starts off with about 4.7GB after loading the software).","910":"When mine died, I had 1,022 songs loaded, but only used a little over 2gb of space.","911":"Other mp3 players won't give you the sonic clarity of the Zen at this compression level, so I imagine they won't at lower ones, either.","912":"Check the Zen's S\/N ratio and DB rating.","913":"They're better than the IPOD, plus, there are seven EQ settings (including custom).","914":"The included headphones suck, so get your own.","915":"Transfering MP3s are a cinch with the included software.","916":"The Zen plays mp3, wma and wave formats, which makes it more versatile than the Ipod.","917":"The greatest thing about the software (in my humble) is that it reads your CD info.","918":"and labels it before you burn the CD into the Zen.","919":"Track #, name, artist, album and genre is automatically-retrieved via internet-labeled, and properly catergorized into the Zen.","920":"This feature wo!","921":"rks almost without fail, no matter what your taste in music is: From relaxation music to hard rock, to hip hop, to Korean and Japanese, to Afro-Cuban and Salsa, Jazz, Blues, Country and Pop, this feature performs well.","922":"Just check the menu on your Zen, and it's all there, and neatly stored.","923":"At least, that is, while it's still alive.","924":"The touch sreen navigation will take a little getting used to, but once you do, and while the Zen is still alive, it's a great alternative to the marching in lock step with the click wheel commies.","925":"It's a tad too sensitive for a first time user (my family member, however, had no problem with it), and it drove me nuts at first.","926":"A trick I used was to manually capitalize all the info.","927":"going into the Zen from my computer, so my stubby, clumsy fingers could cordinate better with my color blind, near, far and mid sighted eyes.","928":"Once I did this, visions of burning my CDs-literally-dance around my head, and all was right in the world (of course, I would have backed my files up, silly).","929":"The features this thing has are !","930":"just too numerous to list: FM radio, which has weak reception, but at least it there, and a microphone, to name just two.","931":"Oh, and another is the cool \"halo\" light that surrounds the touch pad, and light's up when you touch the screen, and how the light glows when the Zen is connected to the computer.","932":"But, the Creative Zen Micro is plagued by a serious, serious stupid and elemenatary design flaw, and I'm going to tell you what it is...But first, two more things about this piece of garbage that's so great and could've made it a potenial IPOD killer.","933":"One: It's size: It's smaller than the Ipod Mini, and holds more music (5GB to the IPOD mini's 4GBs).","934":"It's smaller, in most cases than the palm of your hand, and is ergonomically curved.","935":"I loved this thing.","936":"I've had Dell Pocket DJ owners, IPOD mini AND Shuffle owners marvel at this thing.","937":"It cost less than, in most cases, $190.","938":"Two: it has a removeable\/rechargeable battery, so you don't have to send the thing in when the re!","939":"chargeable battery runs out; thereby, waiting 3 weeks to get it back, and possibly with all of your music erased.","940":"But, all of this means nothing, because of the serious, serious, stupid and ridiculously elemenatary design flaw: After 3 months, give or take a few weeks, you won't be able to hear anything.","941":"Why?","942":"because the \"engineers\" at Creative screwed up the design of the headphone jack.","943":"It's an admitted design flaw that the people at Creative have acknowledged (google it).","944":"There are bulletin boards and customer reviews all over the web talking about it.","945":"If you send in your Zen to have the flaw fixed, you lose all of the music you've been loading into the thing for 2-3 months, which came out to 1022 songs and 80 albums for me.","946":"Again, the headphone jack on this thing is garbage.","947":"It comes loose after 3 months-give or take-of careful use.","948":"Using right angled jacks on your headphones, which minimizes the movement of the headphones while plugged in, won't alleviate the problem.","949":"I used them.","950":"Again, this is a design flaw in the headphone!","951":"jack that Creative has acknowledge.","952":"I know what you are thinking.","953":"You once had a cheap CD player (or walkman) that had the same problem, and you just used miniture screwdrivers to push the left\/right prongs out.","954":"If only only it was that simple.","955":"The flaw is inside the Zen.","956":"You can't see it by looking into the jacks where the prongs are.","957":"The flaw is in the circuit board that the headphone jack is connected to.","958":"In other words, you have to do almost the equivalent of open heart surgery in order just to see where the problem is.","959":"There are do it yourself sites (with pictures)that show you how to repair it, but keep in mind that you will have to break the warranty seal, which means?","960":"Exactly, warranty voided.","961":"So, if you don't won't to void your warranty, you will have to get in touch with Creative, they will send you a rma number, fix your Zen, but you lose all of your dogon music.","962":"The Creative Zen Micro is a Zen Micro killer, not an Ipod killer.","963":"Do your research; check !","964":"out the bulletin boards.","965":"Why would anyone buy this when you can get a 20GB iPod that will hold 4 times the number of songs (and even MORE if AAC encoding is used) for the same price???","966":"In addition , iPods can be used as portable hard drives and can display your calendars and contact info.","967":"This player is fantastic in terms of audio quality, ease of use, and features.","968":"However, if you are considering purchasing one to use with subscription music services like Napster-to-go, or Yahoo Music Unlimited, there are a few things to keep in mind:  1.","969":"To use the Creative Zen player with a subscription service, you need to go to Creative's web site, and download new software for your PC.","970":"You will also need to download and install new firmware on the player.","971":"At the time of this writing, that firmware is a \"beta release.\"","972":"I haven't seen any problems yet, but if you don't like to tinker a bit, this player can be a little challenging to set up.","973":"2.","974":"","975":"It makes USB 2.0 feel like USB 1.1.","976":"This doesn't affect standard MP3 files - just subscription WMA files.","977":"The solution?","978":"Use Windows Media Player 10 to do your transferring.","979":"The subscription files are still a little slower to transfer, but it's only by about 10% or so.","980":"3.","981":"Subscription files need to buffer when you first hit \"play,\" so there's a 4-7 second delay before the first song starts.","982":"However, once an album is playing, there's no gap between songs.","983":"The player intelligently pre-buffers the next song.","984":"Again, this doesn't affect regular MP3 files - just subscription DRM-encoded files, like those from Napster-to-Go or Yahoo Music Unlimited.","985":"These issues knock a single star off the review.","986":"Otherwise, this is a great \"alternative\" MP3 player for those of use who don't want to worship the mighty all-powerful Apple.","987":"I got it to use with the new $5-per-month service from Yahoo (Music Unlimited,) and despite the above issues, I love it.","988":"The subscription service lets me download as much as I want, and the player lets me take it wherever I go.","989":"Nobody has clearly articulated what exactly about the Ipod mini makes it better than this product.","990":"I have visited multiple websites, and for virtually EVERY new hard-drive-based mp3 player I find, there are always user reviews that smash the new player and say something like \"Just go buy an Ipod!\"","991":"Apple apparently has built up a very nice following of brainwashed consumers.","992":"It is unlikely that you will EVER get the best products just by sticking with one company.","993":"What is the conjunctive probability that each successive product release will be without flaws or that the company isn't having turnover in the R&D department (or making bad management decisions)?","994":"Apple never was involved with a lot of audio products until the Ipod.","995":"I have owned some kind of Creative audio product since 1993 and have never had to call tech support.","996":"Of course, some were better than others, and I probably could have gotten a better sound card from another company at some point.","997":"The main issue now is that this new Zen Micro seems to be the best on the market at least temporarily.","998":"It beats Apple on the storage space, it beats apple on the removable battery (and batter life), and I personally like its interface more than the Ipod scroll wheel.","999":"Further, the tech specs suggest that it has better audio quality than the Ipod.","1000":"It may be that the next Creative product is complete junk, but you should make product decisions based on product attributes NOW, not based on a halo effect of an idealized company (Apple) or other pointless loyalties.","1001":"I have had several MP3 players over the past few years, and have to say that this by far is the best that I've owned.","1002":"(The others include: the Intel Pocket Concert, the Archos Jukebox, which was returned after three or four faulty units...I'm extremely patient, and the Creative Labs Nomad Jukebox 3.","1003":") A previous reviewer has mentioned several different issues with the 'Zen Micro'.","1004":"However, their player seems to be defective and Creative Labs should be contacted before making such harsh statements if they haven't been contacted already.","1005":"I must say that there are several factors that influenced my purchase.","1006":"An Apple Ipod Mini was considered.","1007":"However, the Ipod does not come close to the number of extra features that the 'Zen Micro' has to offer.","1008":"Some features that the 'Zen Micro' has that sold me on my purchase include: a 5G hard drive...actually an SD flash card drive...very large and much more than actually needed, the ability to sync with Microsoft Outlook's calendar, the long battery life of about 10 to 12 hours (I can change the battery myself for about $40 to buy vs.","1009":"sending the unit to the company of purchase which costs about $90), the ability to record with a built-in microphone (great for recording reminders and meetings), very sturdy construction, and not to mention...the sound quality is excellent!","1010":"As far as user interface is concerned, the best and easiest to use seems to be the one that comes with the player, 'Creative MediaSource Organizer'.","1011":"It comes with a built-in program simply entitled 'Creative MediaSource Audio Converter'.","1012":"This program enables the user to batch convert and convert audio files from one format to another.","1013":"These include: MP3, Wave, WMA, WMA Pro, and WMA Lossless; it is very user-friendly simply by right-clicking the file(s) to be converted.","1014":"By far this seems to be the best value out there for the money; if you are undecided, the Creative Zen Micro seems to be the best choice.","1015":"I don't know, maybe I got a defective one but first, the player would not shut off, next, the player would not come on - I had to send it away to get repaired.","1016":"Now, the player's ear phone jack is not working - I have to send it away again.","1017":"When it's working, it's great but it is very tempermental."}