{"0":"I've had this beauty for nearly 2 months now and I truely love it.","1":"The only disappointment so far has been battery life.","2":"Mine generally requires a charege every 48 hours or so and I don't really talk on it that much.","3":"Why is this phone so great?","4":"Simple.","5":"It has it all.","6":"This is the first phone I know of that has the large bright screen, infrared, bluetooth, USB connector and a speakerphone.","7":"If you are looking for an upgrade, this is definitely the phone for you.","8":"I got this with the need for a nokia GSM camera-phone with speakerphone.","9":"3660 had similar features, but that is big in size.","10":"6600 looks and feels nice.","11":"This one is full of features(has bluetooth).","12":"Especially the LCD is big and the camera quality is among the very best around.","13":"I have set up it's PDA features with avantgo.com where you can download info from sites like weather,mapquest maps\/directions into it, which is great.","14":"Using supplied s\/w, you can transfer all addresses from a different nokia phone into it.","15":"Goes ~3 days after a charge.","16":"Its been 11 months now that I've held on to my Nokia 6600 for.","17":"I purchased this phone knowing it was slightly old as compared to the newer models of Nokia phones available.","18":"I thought it was kind of steeply priced at that time.","19":"I must add to the dismay\/delight of readers this phone is simply the most groundbreaking phone mankind has ever held.","20":"It has raised the bar owing to number of features it offers and the absolute ease of use delight.","21":"Now I'm a techy and like getting technical about things so I'd brief you in on the few features I liked about this phone-","22":"1.The Phone has the best keypad any Nokia phone has to offer.","23":"My dad has a Nokia 6670 before which he has a Nokia 7210 and before that he had a Nokia 6610.","24":"I think the keypad on your cell phone is the most important thing for me as Im constantly sending messages , calling people and fiddling around with my phone.","25":"Believe me when I say this I have used and fingered all Nokia phones and the 6600 has the best keypad","26":"2. The looks are absolutely no nonsensical.","27":"Some complain it being a tad too bulky looking.","28":"I must admit its not the best looking phone ever but then it has this look of static and absolute conviction that looks like everything a phone should be","29":"3. The Nokia 6600 has a brilliant Java interface.","30":"There's a whole lot of things you can do with this phone besides reading a book , playing various Java games , having a variety of software installed.","31":"The Phone offers a 32 Mb MMC card and I think that is certainly the most exciting feature.","32":"I upgraded mine to a 128 MB MMC Card via which I can store unlimited number of messages, take a thousand pictures and videos.","33":"Capacity is not a problem here.","34":"4. The Build is just right.","35":"The phone is sturdy.","36":"I've dropped it atleast a dozen times to my recolletion and it still works as good as ever.","37":"Its a tough one this unless you wanna drive your car over it.","38":"This isn't the most rugged phone ever but then your not gonna play aeroplane with this,are you.","39":"5.The Camera installed on this phone is awesome.","40":"I click pictures in JPG format and because the phone has a bluetooth device I find it extremely easy to transfer pics to my pc and forth.","41":"The display and brightness on this phone is quite extraordinary.","42":"The use of 65536 (16bit) colors ensures you get your share of animations and icons on your phone","43":"Besides the above mentioned Merits , the phone has decent ear volume and loudspeaker functionality.","44":"It has great upgradibility.","45":"I can play MP3 files on my phone by simply downloading softwares freely available on the net.","46":"Now that is neat.","47":"The log functions helps you track down the incoming , outgoing calls in the most easy of ways.","48":"The handsfree provided by the phone is useful for those who talk on the phone while driving.","49":"I wouldn't do that because it's not worth my life.","50":"Anyhow some demerits of this phone, The phone has a slow processor and the ear volume is lower than 6610 but then the 6610 has the best ear volume among most Nokia variants.","51":"The battery life of this phone is at most 2 days and at least one day at excessive use.","52":"Video recording is limited at just 9 seconds.","53":"You can upgrade but then there's a certain level of trouble involved.","54":"Overall I dont think I will ever upgrade from this phone.","55":"When I purchased this phone , I thought to myself that I had purchased the most popular phone around and the thought didn't please me.","56":"In any case , putting aside how common it is in my city , I dont think I can be anymore satisfied.","57":"This makes for a great phone.","58":"Did I mention the note feature and how you can send notes via Bluetooth?","59":"gee anyways ENJOY WHAT WORKS!","60":"I've had Nokia's for years, and while this one is packed with whiz bang features it is disappointing for its primary use - a phone.","61":"Before buying, I'd urge you to actually use one and not just handle it in the store.","62":"On the plus side it's packed with features, including BlueTooth that works fine - it's really a tiny computer that is also a phone... and that's the negative.","63":"As a computer, or PDA its weak since the screen, while large by phone standards, is still tiny to really do anything on.","64":"And remember, this is a PHONE first and foremost which is where I have my biggest complaints...","65":"When you dial a number, you'll need to check the screen to see that the number entered is correct.","66":"You'll do that because the keys are tightly packed in and your fingers will likely press two keys at once.","67":"I hope you have a magnifying glass, because the number displayed as well as most of the pop up options are tiny.","68":"It's as though Nokia has segregated 90% of the screen for fancy features rarely used and leave just 10% for the day to day use.","69":"I've have many Nokia's and while this is the best for features, it's the worst as a phone.","70":"Sorry, try something else or at least trying using one.","71":"You'll see what I mean ... if you have a magnifying glass.","72":"This phone is flashy and feels good in the hand, but it could not hold a connection to any of my bluetooth devices (headset, handheld, or desktop computer).","73":"My old Siemens s56, on the other hand, worked beautifully with all of the above.","74":"Don't get me wrong.","75":"I love gadgets, technology and whatever electronic equipment you throw my way.","76":"I've gone from almost every Nokia phone since they were only known and operational in Europe.","77":"In those days I've gone from Oki, Motorolla and progressed (actually regressed) to Sony Ericsson's T610.","78":"Now I'm back to Nokia to try their 6600 model.","79":"who in the hell needs a frigging *VGA* camera on their CELLPHONE???","80":"What is that, .00000001 megapixel quality?","81":"Ha!","82":"i bought this phone last march, almost a year ago, in saudi arabia (it came out there before it did here).","83":"since then, i have not found one major problem with it.","84":"i highly recommend it if you are looking for a phone with great camera quality and\/or lots of features you would find in a PDA.","85":"Sure, it is a relatively bulky, but it is really packed with many great features.","86":"I own this phone for about 6 months now, I have used the following features: bluetooth connection to laptop and desktop for sync contacts and calendars with Outlook, transfer files (movies, songs), I have many movies on it now with a 512MB memory card that it takes.","87":"Bought a bluetooth headset and it works like a wonder.","88":"Handsfree future is good, but not too exciting.","89":"Camera is nice, and video recording for some reason is only limited to 9 seconds.","90":"Only thing I don't like about it is slow in changing apps, boot up, and sometime it has problem connect thru bluetooth.","91":"This one has a good looking.","92":"It's oval and... nice.","93":"I like it's shape and it's keypad and joystick.","94":"It's easy to use. Not too small, and not too big.","95":"The screen is quite big (between all handphone), but the just about 65000 color.","96":"And, other else,  the camera is still VGA.","97":"I must say, this one is quite slow to open an application.","98":"Sometimes, it needs few minutes to open an application.","99":"What's wrong with it?","100":"Is it really slow, or what?","101":"Few month ago, it's very popular among my community.","102":"It's good.","103":"But not good enough for me.","104":":! OK, score 7.0 Oh yes, the newest color of this phone is quite cool.","105":"I have overall been disappointed with Nokia in the past, finding that Samsung and Motorola tended to have better quality phones.","106":"While this phone obviously doesn't have the same quality construction as Motorola does, the Nokia 6600 is one of the better phones I've used.","107":"What makes it so great is the versatility and the number of features it has.","108":"The best features that I use most often are:","109":"1) Great audio quality overall.","110":"Handset quality is great, as is the speakerphone quality and the headset audio quality.","111":"2) Camera phone.","112":"A decent camera phone for taking quick pictures, movies, and having general all around fun with.","113":"3) The joystick design they are using on the new Nokias gives you a great degree of control.","114":"The only problem is that occasionally the joystick does start to dig into your thumb while gaming.","115":"4) One nice thing about Nokias is that they have a ton of ring tone and game choices.","116":"If you love your cell phone games or changing your ring tones everyday, Nokia beats everyone else.","117":"5) Bluetooth wireless technology, so that I can transfer data to and from my computer without messing with any cables.","118":"This is great for putting photos and memos on the computer and transferring calander data to my phone.","119":"6) The phone is really wide, which seems to be a turnoff for many people, but the phone is actually easier to grip and feel more ergonomic.","120":"I feel much less likely to drop this phone than others, which are actually starting to get too small.","121":"You will probably have to get a belt clip for it, however, unless you wear the pants with the cargo pockets.","122":"My biggest concern is that I have found Nokia phones lower quality construction to lead to lower prices, but they also don't last as long.","123":"I can tell using the phone that it feels a little flimsier than Motorolas do, but as long as I'm not planning on dropping the phone or running over it with my car it should be just fine.","124":"I wouldn't use it for business purposes and hand one out to all my employees, because you tend to want a little more rugged a phone for that.","125":"Other than that it meets or surpasses all of my needs and surely won't disappoint any already established Nokia phone fans.","126":"OPERATION: It's like BMW's I-Drive - It does it's job, but has the most unintuitive, overly-layered interface.","127":"For example, the memory card is under the battery.","128":"The phone must be shut down & taken apart to change the memory card... and turning the phone back on takes a little while.","129":"This is representative of the entire phone operation.","130":"Not for the impatient.","131":"If you've never used an advanced mobile phone before, you might assume this is par for the course, but it simply isn't.","132":"Even the instruction booklet is out of order.","133":"APPLICATIONS: It has lots of applications and they work very well... when you eventually find where they are and they finally open.","134":"No matter how accustomed to the phone you become, too much time is required to get to, open and close applications.","135":"On the other hand, one may leave many applications open at once, hide them and return to them just where they left off - similar to a Mac.","136":"Me likes.","137":"The 6600 has more ameneties than most - World phone, Camera (VGA\/zoom\/night mode\/timer), Video (w\/ audio & zoom), Speaker (good sound), Bluetooth, infrared, Modem for computers, electronic wallet, Internet access, Calendar, calculator, converter and more.","138":"The phone does not have an Mp3-player, FM radio, 200k+ color screen, megapixel camera, quad band, PDA, photo editor.","139":"I'm not sure that a phone w\/ these and all of the above features exists just yet. ...I'm not sure I'd want to spend THAT much time w\/ a device, anyhow.","140":"DEPENDABILITY: I've seen no glitches.","141":"I've had no problems w\/ this phone.","142":"STYLING\/ERGONOMICS: The keys are small, which generally doesn't bother me if they are spaced because I can employ a little 'Braille,' but the keys run into each other, so careful attn. must be paid when dialing.","143":"As for appearance, well, that's subjective.","144":"Few will look at the phone and know it's 'all that'.","145":"It's not as stylized as a Sony or Samsung.","146":"Less Benz\/obvious; more Audi\/understated.","147":"Although it has chubby hips, the device isn't really so big.","148":"Solid, squeak-free, large screen.","149":"MEMORY\/STORAGE - Seemingly boundless.","150":"First of all, the phone houses a great deal of memory for multiple videos, sound clips, photos, texts, etc.","151":"Secondly, all info can be sent to a computer and w\/o the hassle of USB wires.","152":"Still not sure?","153":"If you max out the phone memory and have sent all you wish to a computer, there is a memory card w\/ a good deal of storage as well.","154":"This is no small deal.","155":"If you're still whining about storage, deleting some games will free-up still more memory.","156":"RECEPTION: This really depends on locale & carrier.","157":"The 6600 (T-Mobile) is the true 'world phone' in that it has the mhz to operate around the globe, including New Zealand and Australia (900) whereas the  6620 (available from Cingular) replaces it w\/ 800mhz (some refer to as 850).","158":"The latter will provide better coverage in more remote areas of The States but still operates in many countries, excluding New Zealand and Australia.","159":"The 6600 will provide similar service in more developed areas of The States and not as well in more remote areas.","160":"As the 6600 uses 900mhz, it operates in more countries than the 6620.","161":"The battery life is less than stellar, but it charges w\/ the quickness.","162":"Remember, this phone uses an operating system - Symbian... and it's feature-rich w\/ 65k colors.","163":"It films 10 second video, for crying out loud.","164":"The battery life can't be very long; let's not be greedy.","165":"GAMES - Java.","166":"Don't use them, so I delete them for addtl space.","167":"In my humble opinion, games, along w\/ 'flip phones' belong in the hands of teenagers.","168":"IMP: Two important pieces of advice - Visit Nokia's site.","169":"There are number of downloads needed\/available for this phone & they will be texted to you at no cost.","170":"The downloads are for basic and advanced operations.","171":"The second piece of advice - Be prepared to spend a lot of time w\/ this phone.","172":"If you expect to be able to pick things up when you're out and in a rush via common sense, many times you'll end up frustrated.","173":"A Sony Ericcson may be the phone for you... but good luck finding one w\/ all the features & such a competitive price.","174":"Keep in mind that for nearly every screen, there are a number 'along side' and 'beneath' them... for every 'save,' there are choices of phone memory, memory card or sim card.","175":"Despite a critical start, this phone deserves four stars because it accomplishes what it sets out to do (which is pretty lofty)... does more than most... does it well... is dependable.","176":"It's a high-line Audi, on a Cadillac suspension, at a reasonable price.","177":"When you consider expandability (downloads via computer), the numerous features, two transmission programs and multiple storage devices, dependability - this is a phone that isn't easy to out-grow.","178":"I would suggest this phone for all but the simple-minded... or those who simply don't need so many features.","179":"*****DO NOT BUY THIS PHONE***** ****READ WHY****","180":"In October of 2003, I bought a Nokia 3650 off of eBay.","181":"It was an OK phone with a really nice screen, great battery life, decent signal, and cool applications.","182":"It was a major step up from a Sony t68i.","183":"The 3650--being essentially a mini-computer--had memory leaks and occassional crashing, but nothing that a quick power cycle couldn't help.","184":"Most importantly, it allowed me to get on the Internet via Bluetooth via GPRS flawlessly.","185":"It's a nice phone, and I'm glad to have used it.","186":"In July of 2004, I purchased a Nokia 6600 from T-Mobile.","187":"Since I use my Palm PDA and T-Mobile offers unlimited Internet, I asked the sales representative if I could use this phone as a Bluetooth modem for my Palm, and he said yes.","188":"So I bought the phone and went on my merry way.","189":"BLUETOOTH DOES NOT WORK ON THIS PHONE.","190":"THE ADVERTISING IS A LIE.","191":"Though nearly a dozen different people at both T-Mobile and Nokia have told me otherwise, it is simply not possible to use this phone as a Bluetooth modem for the vast majority of PDAs and many other devices.","192":"While the two devices will pair, the phone will immediately drop the connection if any data is transferred.","193":"With the recent \"bluejacking\" vunerability, the Bluetooth overseers have created a new security system called Combination Key.","194":"This helps prevent people from sending short \"obscene\" messages to your phone.","195":"The older security method is called Unit Key.","196":"Most Bluetooth devices only support the older security system, Unit Key.","197":"This includes ALL Palm PDAs! Further, due to an unparalled design oversight, Nokia is the only device that supports Combination Key that is NOT BACKWARDS COMPATIBLE with the older devices that people actually own.","198":"Does all this sound technical?","199":"That's because it is, and the only way I learned it was by spending over an hour talking to T-Mobile's tier-3 technicians in South Africa (to learn that the problem wasn't about T-Mobile) and three hours of getting nowhere with Nokia support technicians reading endlessly from scripts, never deviating, until I started cursing and got a tier-2 tech.","200":"Only then did I learn the truth -- THIS PHONE DOES NOT WORK WITH PALM PDAS!","201":"So, after all this frustration of adding all of my newest contacts to the 6600, I asked the technician if it were possible to transfer the data from the 6600 to the 3650.","202":"He advised me to back up the 6600 to a newly formatted Nokia MMC card, and restore the data to the 3650.","203":"I followed the technician's directions to the letter while they were on the phone, and after I had done so, the phone restarted and displayed the message \"Phone startup failed. Contact the retailer.\"","204":"I spent over an hour talking to a tier-2 technician who told me that their tier-1 technician should have known that it was not possible to backup the 6600 to the 3650 safely in any condition.","205":"I could not get the 3650 working to even factory defaults, even after trying every reset code they could muster.","206":"Nokia finally determined that my phone was in need of repair, but since it was out of warranty (it was made in May '03 and they would not take an eBay purchase as proof) they refused to fix the phone for less than $120!","207":"After over two hours of being placed on hold and persuasion, a supervisor finally agreed to fix the phone for free.","208":"I did a little research and discovered that the repair could be done by any basic cell-phone for $30.","209":"All that had to be done was restore the software to the phone, and all that took was a cable and some Nokia software.","210":"I still decided to send in the phone, since insured shipping was only $10.","211":"Two weeks later I mailed the phone in for repair.","212":"Two days after they received the phone, I received a letter in my mailbox stating that if I did not pay $120 for the repair of my phone, it would be returned unrepaired.","213":"I called Nokia to try to get it sorted out, and they stated that they had no recollection of ever promising to repair the phone for free.","214":"They stated that though it was a simple repair they would not do it for less than $120.","215":"I suggested that it didn't make sense for me to send in the phone for repair if I thought Nokia would charge me $120 to repair it since I could get it done locally for $30.","216":"This simple nuance was too much for Nokia, and they still refuse to acknoledge the fact that their technician could have broken the phone or repair the phone for free.","217":"The supervisor stated that it must have been third-party applications on the 6600 that caused the 3650 to break, and would not take the suggestion that his own tier-2 technicians stated that it was not possible to back up the 6600 to the 3650 without damaging the 3650, regardless of what was or was not on the 6600.","218":"In short - Nokia themselves don't know that this phone doesn't work with the Palm, and if you don't heed my advice you will spend hours with technicians around the globe reading from scripts, chiding you in broken english for not following their directions exactly.","219":"You will also hard-reset both your Palm and your Nokia to factory defaults in their lame attempts to get the script to work, though it will not.","220":"Ultimately you will learn just how bad Nokia is, and why their recent loss of market share is so utterly deserved.","221":"The title pretty much says it all.","222":"The photos in the address book are terribly scaled too; they look as though they were built out of legos.","223":"This phone is one of the best I've ever used.","224":"It has everything I needed: bluetooth, infrared, support for MMC, camera, and a good operating system with lots of supporting software.","225":"I would have given this phone 5 stars if it wasn't for the fact that I would rather use my 3330 to do all the most common things you do with a phone.","226":"It's important that people know the following:  First, the interface is slow.","227":"You hit the message button on the front and it takes a matter of SECONDS to bring up the menu.","228":"Same with the contacts list, recent call list and everything else.","229":"Secondly, in addition to the lag each time you give a command, it's just not that easily useable on the go.","230":"The number buttons are crammed into a 3x4cm area, the fonts are small, the interface is too convoluted and frustrating, it's not that customisable as well.","231":"The plusses are the features, look, good signal and battery life, memory size and robustness.","232":"The camera and video functionality is decent, I can't see myself wasting my time with it, but some people will.","233":"All in all I would say wait for the cell phone companies to create a PDA\/cell hybrid that is efficient and easy to use as a phone.","234":"this is a great phone i have this phone since Feb 04 and i never have any problem at all.","235":"very cool features... great camera with zoom...cool quality pictures... great ringtones... bluetooth feature is great....","236":"I have purchased two of these phones together from the Amazon market place.","237":"If you are purchasing this phone, then make sure you can handle the speed of this phone.","238":"This phone is not suitable for fast people, maybe only for old people.","239":"The menu pops up after 3 seconds The picture takes a while to load from its slow card memory.","240":"The navigation takes so much time that it would eventually drive you crazy.","241":"Its like having a 66Mhz computer with a webcam, fax, printer, blue tooth...etc...Just an example..","242":"I bet most of the users of this phone would agree.","243":"Sometimes,the phone gets stuck just like a computer and it doesnt store any incoming call numbers..etc..","244":"If you find a better phone, then I suggest you go for it.","245":"At first glance, I thought this phone was a little too big for me, maybe a little too complicated.","246":"One minute with the salesman and I was sold.","247":"This thing does everything but washes your dishes.","248":"I can use it as a modem for my computer, connect with clients and friends, the possibilities are endless.","249":"The ringtones are beautiful, the screen is super high quality.","250":"I could go on and on---but I won't!","251":"Go see for yourself.","252":"The ONLY bad thing?","253":"I can NOT find a carrier for this phone I like, end up just tossing it in my purse.","254":"I do not need to repeat what's great about this phone.","255":"A few things that I want to suggest for improvements:","256":"1) phone card calling feature.","257":"This phone doesn't include Phone card calling.","258":"So you have to dial your phone card access number, PIN card, and choose \"send touch tone\" and find your contact from the address book.","259":"This process can be very annoying and unsafe when you are driving a stick shift on the highway.","260":"For phone card with PIN Free dialing setup, you are a little bit lucky.","261":"All you need to do is to choose your \"phone card\" contact and then \"send touch tone\" and choose the contact.","262":"This feature is very important to me as I make a lot of international calls.","263":"My old Sony Ericsson T610 has this feature.","264":"All I need to do is to choose the contact and in option select \"calling card call\".","265":"2) Low volume on regular answering.","266":"In noisy environment, it's hard to hear from the earpiece.","267":"You have to use speaker or handsfree, to get larger volume.","268":"Speaker volume is loud and clear but it sacrifaces the battery life.","269":"Most of thew reviews are high for this phone ......","270":"My explanation is that most of the reviewers are americans that live in the states .....","271":"the difference is : until recently there have been no GSM networks in a wide scale , so most cell network companies supplied consumers with cells , we in the middle east (for example) have stopped using years ago ....","272":"So no wonder a lot of people find the 6600 such a miracle .","273":"I have purchased the 6600 when it was first released in The Middle East , almost a month before Europe , and reading the brochures and features , it really did sound like a true all-in-one functionality monster .","274":"Unfortunately , I sold it exactly a month later .","275":"1-A cell phone is to make CALLS , in other words , quality of reception and mic\/speaker are the most important , the 6600 has a relatively low volume speaker , you'd have to press it hard against your ear to hear anything the other person is saying , unless the surroundings were completely quiet .","276":"2- It is bulky and the small buttons on the sides are sloppy to use .","277":"3- It is SLOW , if you keep the original configuration and progs (why'd u buy it then ?!) it'll run smoothly , but still slower than most other coloured-screen Nokias .","278":"As soon as you copy video\/audio files and add some programs and games , it WILL hang at least 5-10 times a day.","279":"A firmware upgrade is irrelevant .","280":"4- My idea was that it was an all-in-one , and that theory -once again- proves wrong , this phone excells at nothing , less  than average in everything , if you seriously need any of the \"other than phone\" functionalities , you'll be disappointed .... if you have lots of money and bought it for the love of gadgets then fine .... but don't expect to get much done .","281":"5- If you already have a girlfriend and\/or wife , you won't need Bluetooth lol .","282":"Basically the 6600 is a bundle of over-hyped features you don't and won't need (if you do get yourself a PDA or pocket PC) , none of them work as they should , and the basic phone functions and ergonomics are less than average .","283":"I'm an advocate of Nokia , but this phone and the following models (7610) , are seemingly a desperate trial at squeezing as much under-engineered and experimental technologies in one sloppy phone .","284":"I'm giving it 1 star because as compared to other Nokia phones , its a 1 , compared to other blunders by other companies (such a samsung and motorrola) it might be good .... but if you're getting a Nokia , don't get this one .","285":"I bought this phone a few months ago and I have been using it since then.","286":"I never had a single problem.","287":"It is Nokia and thus easy to acces the menu options.","288":"High quality video and pictures rock!","289":"3 band and you can just change the SIM card in it to be able to use it in Europe with another service provider.","290":"Bottom line great phone for the time being.","291":"I use a Nokia 6600, it has a great color TFT display and camera equipped with zoom, which complement a built-in video recorder with audio and a RealOne player for playback and streaming of 3GPP-compatible and RealMedia video clips.","292":"Multimedia functions are enhanced by multi-slide MMS messages and a Gallery for organizing digital content captured or downloaded with the phone.","293":"So, do I recommend the 6600?","294":"Yes, certainly.","295":"But if you are in the market for a new business capable phone, and don't want to deal with a stylus equipped PDA like device such as the P900, then the 6600 will probably suit you just fine.","296":"The Nokia 6600 is a decent extension of the smartphone line.","297":"The phone has such advantages as the excellent keypad and display, long rundown time and a good software suite.","298":"Among its weak points is the MMC slot location and a bit vague design.","299":"In short, the Nokia 6600 is an evolution but not a revolution.","300":"I'm sure you can read the specs above to see everything it does, but for me the best thing is that I can easily check my email, movie times, news, or any website with this phone.","301":"You can take pic of your friends and the picture will pop up when they call.","302":"Give each friend a different ringtone.","303":"Get great themes and wallpapers for this phone and many many polyphonic rings.","304":"A huge beautiful color screen which can not been scratched at all even with the rough handling i give it.","305":"Nokia makes great phones, and this one is the cream of the crop.","306":"Best phone i've ever owned, period.","307":"I've been using this phone for 3 days now, and while I admit that seems doesn't seem like very long -- I should also point out that I've been using it almost non-stop.","308":"Frankly, I think this is one of the niftiest pieces of hardware I've ever used.","309":"It is slow to initially start up, but once it's turned on, I've never had any complaints about the speed.","310":"Over the past three days, I've only had to turn the phone off twice, so I rarely have to deal with the delay in initially booting the phone.","311":"Everything, so far, has worked flawlessly.","312":"I've synched it with my PC over bluetooth.","313":"I've synched it with my Jabra 250 bluetooth headset.","314":"I've been on the phone, while browsing the net over a GPRS connection, while sending a text message.","315":"All at the same time, and all without a hitch.","316":"I think the interface is great.","317":"I actually purchased two phones recently (this one at the new Blackberry phone), and this one is far superior (IMHO).","318":"In short, I don't have a single negative thing to say.","319":"I love the features, the interface, the size (the screen is a delight), the camera (though I admit I'm not much of a camera user -- so just a toy for me), the internet connectivity, the quality, etc.","320":"If I had to do it over, I wouldn't buy anything else.","321":"I bought this phone after having other phones that had less-than-consistant reception.","322":"UPSIDE: This one, like most Nokias, receives a consistently strong signal (I've tried some Samsung and Sony Ericsson models which were very weak on the reception front).","323":"I love the Bluetooth; easy to use with a wireless Jabra headset.","324":"Photos are pretty darned good!","325":"DOWNSIDE: It takes a long time to start up.","326":"My last simpler Nokia started right up and was immediately ready for use.","327":"The \"movies\" last about 5 seconds.","328":"I mean, they're short!","329":"Why have the function if you can't film anything longer than e few seconds?","330":"I find this feature on this phone useless, but, since I don't really need this function anyway, I don't really use it.","331":"Also, when I dial an \"800\" number like an airline, it will not allow me to use number keys to navigatee the prerecorded menu.","332":"This is a MUST when you need to get flight times, connect to reservations, etc.","333":"Finally, after about a week's use, the screen started to freeze on me.","334":"It would not hang up on calls.","335":"Once it froze so bad I couldn't even use the power button to turn it off, and had to open and take out the battery.","336":"Probably a great phone overall, and perhaps mine just has bugs.","337":"But beware of the bugs; they are major!","338":"What I have found useful to consider before purchasing a phone:  - decent battery life - good call quality - user-friendly interface - camera\/video functions - bluetooth - ability to sync contacts stored in the PC with the phone (no more manual entries!)","339":"With one of the most intuitive user-interfaces around, seamless bluetooth sync with Microsoft Outlook, support for thousands of applications for the Symbian platform which this phone runs on (I own the IR Remote, ICQ and a few others), the Nokia 6600 is all of the above - one of the few phones from T-Mobile that can claim such a distinction.","340":"Ive had this phone for a year now - and its the best phone I have owned.","341":"The only con I can think of is the lack of a mega-pixel camera.","342":"Motorola's phones are well engineered but have an user interface that reflects very poorly on what is otherwise an excellent engineering company.","343":"Its a real shame that T-Mo does not offer the newer Nokia models.","344":"According to a survey, more customers are ordering their cell phone and service from AMAZON.COM","345":"But if you are one of the customers contributing to this, its a big mistake.","346":"I have ordered 2 \"cell phone + service\"s from Amazon.","347":" The first shipment took such a long time, I had to cancel it.","348":"The second one is on hold for almost 2 weeks with a message that \"Can be delayed further\".","349":"So if you order one of the top 10 bestselling phones from Amazon now, it will take at least 3 weeks for your shipment to be delivered...guess Amazon is waiting for seconds to re-package,","350":"This may be a really cool phone, but it's not worth it with T-Mobile.","351":"They have the worst service of any of the major companies.","352":"I really regret signing up with T-Mobile, but I'm stuck with them for the next 6 months of the contract.","353":"If you're looking for a new company, don't be fooled by the service plans.","354":"T-Mobile's minute plans are cheaper for a reason.","355":"This phone is fantastic.","356":"Great reception, visibility and interface (may be complicated by others).","357":"Just don't get drawn into T-Mobile's catchy rebate.","358":"T-Mobile wasn't upfront about some of the terms to qualify for the rebate.","359":"I highly recommend this phone.","360":"I had a Sony ericsson T610 before this and the T610 is far inferior.","361":"I find it difficult to remove back cover so is you plan to have a spare battery and replace it I suggest you don't ,besides it has a long battery life.","362":"Im able to keep my phone on for about a week (mostly stand by) to three days (regular use)","363":"I used to work with t-mobile..","364":"i have owned many phones with them such as v60, 6190, e715, 6610, v66, v205.... and the list can go on!","365":"but this by far is the best phone out there right now!","366":"yes it is a bit large, but the realestate on the screen will spoil you!","367":"i have a hard time using other phones with smaller screens!!!","368":"the OS is abit confusing at 1st, but within a few days you will pass this learning curve!","369":"I use this phone as my quick and dirty digital camera!","370":"the pics can be touched up in photoshop, and be printed at 4x6 and they look great!","371":"i also use the phone as my modem via bluetooth to my Apple powerbook!","372":"The speed is the same as dail up, where i live we do not have wifi everywhere so this is my version of it until we catch up.","373":"I have used this wireless internet almost everywhere i travel and it works great.","374":"If you own an apple you can isync it to your address book so that you have all of you numbers in two places..... in case you lose your phone (get INSURACE)","375":"the stand by is really good considering all the toys this phone has and the screen size!","376":"i would highly recommmend...... oh and i have owned this baby for like 6 months now","377":"The phone itself is pretty nice.","378":"Camera quality isn't bad for the low resolution.","379":"Menu is a bit slow, but overall, phone is very functional.","380":"But watch the Amazon rebates on these (T-Mobile rebate is fine).","381":"You have to wait to get your second bill before you can send the rebate form in. \\","382":"Depending on the timing of the postmark date, you don't get your second bill until the postmark date passes, so it's impossible to qualify for the rebate.","383":"This phone has a nice blend of features without going overboard.","384":"I was using a Motorola T720i with Verizon and I had alot of dropped calls and I had troubles syncing data.","385":"I was looking for a phone which synced with Mac OSX using Bluetooth, had decent battery life, could check email, had good reception, nice screen size and was durable (I break often break small gadgets)","386":"The interface is simple to use.","387":"I saw a few complaints on the load time of menus and I feel people are over-exaggerating the menu load time.","388":"I have a couple hundred contacts and the menu loads within a few seconds, no big deal.","389":"I did notice if you turn the phone on and off the OS takes a bit to load up and initially the menus are slower but once the phone has been on and booted up the menus are reasonably quicker.","390":"The camera is adequate and if I want high-res photos I'll use my digital camera instead.","391":"On the T-Mobile service I was able to take pics as we drove across I-70 and email them to family & friends once we reached a T-Mobile tzone (usually a major city).","392":"Outside of the T-Mobile service area the phone seamlessly jumped onto AT&T Wireless and various other services where the T-Mobile service was unavailable.","393":"As I drove across the country I lost reception only in eastern Kentucky's mountains.","394":"Along the way we compared it to my wife's T720i and the 6600 was superior in terms of battery life, connectivity bars and features.","395":"For those Mac OSX users out there, iSync works fairly well.","396":"On occasion I'm not able to connect to the phone with iSync via Bluetooth but I found that rebooting the phone seems to solve this problem.","397":"And Bluetooth does not drain the battery as quick as I thought it would, I usually can go 1.5 days with Bluetooth on along with making calls before I need a full recharge.","398":"With Bluetooth off the phone last almost twice as long.","399":"The nokia 6600 is a great phone, good games, good camera.","400":"The video recorders a bit odd, sometimes I get 9 secs on my recordings, sometimes I get 17.","401":"The voice recorders good, but you can't record songs off the radio for ring tones.","402":"The games are decent, but u only get 2 to start off with.","403":"But you can download some really good ones like pac-man or mafia wars.","404":"Overall the phones fantastic, and I would have given it 5 stars, but its not perfect.","405":"If your looking for a phone thats mainly for calls and killing time this is the one you want.","406":"The battery on mine lasts 2 days if I don't play games that much, and it only takes 90 mins to charge from flat.","407":"This phone has the best battery, it lasts longer then my old 3210","408":"I got a 1GB MMC upgrade for this phone and now I can:","409":"1. Record around 1 hour of video with Phillips Camcorder Pro.","410":"2. Take around 10,000 640x480 pictures.","411":"3. Play Java games on it.","412":"4. Play N-Gage games on it.","413":"5. Check traffic411.com for LA traffic on the 405.","414":"6. Play Gameboy Color games on it with GoBoy.","415":"7. Have a good chunk of my small MP3 to listen through the speaker phone.","416":"8. Connected the phone to my tablet pc and now can access company VPN at 56k speed via bluetooth.","417":"Clear the call logs once in a while to speed up the phone people!!!","418":"As for bluetooth, no problems at all.","419":"I've connected the phone with two laptops and a iPaq 4155.","420":"Very simple and painless.","421":"This is the first cell phone I've owned, and overall, I am quite pleased with it.","422":"I purchased this phone after researching many different phones, mostly Nokia's that were T-Mobile compatiable.","423":"Among my requirments for a phone were: good screen, decent camera, bluetooth, and GPRS support.","424":"The 6600 was the best phone I could find with these options that I could get with t-mobile.","425":"One primary reason for getting a cell phone was so that I could use it as an internet connection for my laptop running linux, where softmodem drivers are hard to find, and don't work very well.","426":"If you are using Linux, and you want to use GPRS to connect to the net, I suggest this phone along with a Belkin USB Bluetooth adapter.","427":"For the linux users out there who are intrested in my setup: I'm running Debian (Knoppix 3.4) with a custom 2.6.7 kernel.","428":"On a DELL Inspiron 8200 with a P4 2.0ghz system with 1gb RAM.","429":"The KDE Bluez system for bluetooth support.","430":"I have really enjoyed the camera on this phone.","431":"Although the images are not the best in the world, its very handy to have a camera everywhere you go.","432":"And the phone has a very cool feature wich allows you to send images via a normal POP3\/SMTP e-mail account.","433":"I will also say that setting up the e-mail account was very simple and straight-forward, although you do need an external SMTP server to use.","434":"The phone can use any MIDI audio file as a ringtone.","435":"Which is really nice because you can get pretty much any piece of music in MIDI format for free on the net.","436":"You can use the OBEX File Transfer service with bluetooth from linux (KDE-bluetooth provieds a nice intergration into Konqueror for this) for sending files to the phone.","437":"The fact that you can assign ringtones to people and\/or groups is really cool.","438":"Apparently some phones don't allow you to give an entire group a ringtone.","439":"I will say that the OS that the phone runs does have a few issues.","440":"Sometimes, various applications crash.","441":"Especially the bluetooth server... Meaning you have to restart the phone if you want bluetooth to work again.","442":"This is somewhat annoying, but from working with computers (espcially windows -- ugh...)","443":"I'm used to having to restart things.","444":"On average, I prolly restart the phone every two days.","445":"I use this phone exculsivly with a Jabra Freespeak 250.","446":"I really dislike holding a phone to my ear, and I've found the Freespeak to be very comfortable and easy to use with this phone.","447":"The only main drawback is the fact that the voice-dialing system is kinda picky.","448":"It takes a while to learn how to use it right, and at this point I am able to make about 70% of my calls using it.","449":"However, it needs to be quite quiet for it to work at all -- dosn't work at all in the car, for example.","450":"Some people have commented about the size and weight of the phone, and it has rightfully gotten the nick-name \"the bar of soap\" which, it really is.","451":"But if you use all bluetooth accessories, as I do, its really not an issue.","452":"All in all, this is a great phone.","453":"Especially for the price amazon gives it at (I was unable to get mine through amazon due to some credit complications).","454":"If you use linux and want GRPS and\/or want to use a handsfree bluetooth device, and want a decent camera -- this is the phone for you.","455":"I really love this phone...","456":"I also am loving T-Mobile (100 times better than ATT...","457":"you actually can talk to a real person for support in under an hour!).","458":"Have had the Nokia 6600 for a year now and am generally very happy with it and with T-Mobile.","459":"It offers way more features than I need but the ones I use work well.","460":"I almost always get a good strong signal, even in fairly remote areas here in the southwest.","461":"The sound quality is excellent and the speaker phone couldn't be easier to use.","462":"I like the size and shape.","463":"It fits comfortably in my hand and pocket.","464":"The only problem is the size of the keys.","465":"My fingers are kind of stubby so it took a while to learn how to hit a key without hitting the adjacent ones.","466":"They really are awfully small.","467":"Also the battery life isn't great but it's sufficient for my needs.","468":"It also works just fine for international calls.","469":"It's a bit pricey to call home from other countries but the instant messaging to and from covered countries in Europe are quite reasonable.","470":"It's really well made and has survived sliding across floors and pavement without a scratch.","471":"I've had nothing but good luck with T-Mobile.","472":"Their customer service agents are always prompt and polite and my service is terrific.","473":"I never get dropped calls.","474":"It seems to be a much more user friendly company than Verizon and a thousand percent better than the horrible Quest Wireless.","475":"I recommend T-Mobile and the Nokia 6600 without reservation.","476":"The Nokia 6600 is really just a glorified 3650: you know the 3650, those bulbous, formless, big phones a few unfortunate ATT customers are carrying around.","477":"The Nokia 660 runs the Symbian OS, which works pretty well for most standard phone fare, most of the stuff is not that intuitive, but if you actually learn how to use it all, there's plenty of neat tie-ins.","478":"I've had this phone for almost a year now and it has been nothing but great to use.","479":"I can connect to my computer via bluetooth to transfer images, calender events, contacts and anything else.","480":"Another great feature for me anyway is the ability to load .wav sounds as ringers.","481":"This way I never have to be ripped off by the carrier for stupid ringtones, I can get whatever I want.","482":"The only downside I have found with this phone is that it is a bit slow to react, meaning when I push the contacts button, it takes a while to load, this is true for almost all the menus and programs on the phone.","483":"Other than that, the simbian series 60 OS is great and offers lots of proprietary software that will work on your phone if you're willing to hunt for it.","484":"Hand set is good, but be aware of this T-MOBILE rebate.","485":"These people takes lest effort to process rebate forms.","486":"For last one month my Rebate status showing me that my rebate is apporved and check is delivered but still I am waiting for Check.","487":"There is no way you can talk with customer care about this.","488":"Dont rely on T-Mobile rebates.","489":"I bought 2 of these Nokia 6600 phones recently, thru the amazon market place.","490":"Initially these phones were fun to play with some of the cool features like the speaker phone, web browser and ofcourse the built in camera.","491":"So on the whole, let me summarize the good and bad things about this phone, instead of writing a long review.","492":"The good:  1) Large LCD screen, colorful display, good resolution.","493":"2) Nice features, like web browser, camera, video recorder, speaker phone (very usefully), clear voice reception.","494":"3) Joy stick for eazy navigation, 35Mb memory card to store the pictures and stuff.","495":"Now the bad:  1) As usual, battery power not sufficient for daily usuage.","496":"3) Joy stick for eazy navigation, 35Mb memory card to store the pictures and stuff.","497":"The battery power discharges rapidly especially on using the web browser.","498":"2) Phone is awfully slow.","499":"Sometimes when you press buttons, the menu appears after a second or two.","500":"3) Phone is kinda heavy, but small in size.","501":"Looks big in the display ads though.","502":"4) Buttons are quite small and is really a pain exp if one is fond of text messaging.","503":"There will be much erasing of text as, one would tend to type something instead of the actual letters.","504":"5) Video recorder is of no use and one cannot record something useful in 10 seconds and it takes a while to send the same through the \"Free picture and video messaging\" offered by service provider.","505":"So my review should defintely give you an idea about this phone.","506":"The bottom line is \"Phone is cool one - only for the moment, as its the latest phone in the market and has all the new features, but this will soon be displaced by upcoming newer phones\".","507":"my number one criteria for a new phone was iSync compaibility via bluetooth.","508":"all the other features are gravy.","509":"i checked the iSync compatibility page and it was listed--they even had a photo of the 6600 shown in the graphic.","510":"so, right out of the box i had issue.","511":"namely, it wouldnt sync.","512":"after scouring the various boards i find this is an arbitrary and pervasive problem.","513":"there are lengthy hacks offered requiring root access and edits via terminal.","514":"i may have been up for this 10 years ago, but i just want a phone that works at this point.","515":"i guess its my own fault for not researching more before buying the thing.","516":"but, i am quite unhappy with nokia at the moment.","517":"if you are looking for a phone to integrate as easily as the sonyericsson phones with iSync, i say stick with a sonyericsson.","518":"i'd rather have a little more phone than the t610 offers.","519":"but, that's the only SE t-mobile offers right now.","520":"this nokia is going back to china or wherever it came from.","521":"if there was a zero-star rating i would give it.","522":"went with T mobile Nokia 6600 replacing my Sony T610.","523":"It is a multifunction phone, reception quality is better than the 610.","524":"speaker phone quality is good, and poping in a 512mb MMC card, it rocks !","525":"putting in MP3 player, lots of games and application to download.","526":"DOwnside is the size of the phone, it is BIG for today's standard.","527":"and the battery life is bad !","528":"I could hardly use it without a recharge in 2 days!","529":"a bit dissapoitnd on that!","530":"the GPRS web access is sloooooooooooooow!","531":"DaveC","532":"I got this phone yesterday and didn't find any problems with it yet.","533":"Picture and video quality is ok.","534":"Love the speaker phone.","535":"INCREDIBLE MEMORY!","536":"Aside from a 6MB++ built-in phone memory, there's a 32MB MMC card that goes with it!","537":"Picture quality's great for still and video with sound.","538":"you can record your voice and turn it into a ringtone.","539":"you can't do that with a Sony T610 (which i traded for a 6600).","540":"T610 supports only midi files.","541":"N6600 supports midi, wav, amr, mp3 etc.","542":"it has a handsfree loudspeaker, conference and transfer!","543":"i'm having mine upgraded to capture endless video, which right now allows 10 secs.","544":"I'll have to buy bigger MMC card of course.","545":"I love this phone.","546":"This phone is one of the milestones in the history of the cellular phones.","547":"Supporting an operating system, Symbian OS, you can download and run a lot of programs on this phone.","548":"You can turn this phone into a gaming machine, a camcorder or a digital camera, an mp3-player, a movie viewer, a voice recorder, a personal secretary, a GPS map browser, a book, a multifunction remote controller, practically everything that you can do with the computer, plus it is a phone(!!) and also you can carry it in your pocket :).","549":"Many of these programs are shareware, some can be purchased by paying a little bit of bucks.","550":"It uses the extendable MMC memory, it is perfect for storing videos, pictures and mp3s.","551":"Its nice look is also a plus.","552":"And also, since it is tri band and since it uses SIM-card, you can just use it in Europe and many other parts of the world, wherever GSM exists.","553":"I am just in love with this phone, especially after using a more primitve phone about 3 years."}